jojo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-06-20 Mon 11:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>jojo</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="XIE Yuheng" />
<link rel="stylesheet" href="http://xieyuheng.github.io/asset/css/page.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
長悲嘆而掩面兮 憐其獨於夢睹
</div>
<div id="content">
<h1 class="title">jojo</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9ed3b31"><span class="done todo">todo</span> </a></li>
<li><a href="#org73546d6">helper</a>
<ul>
<li><a href="#org380035f">header</a></li>
<li><a href="#orge191bc9">bool</a></li>
<li><a href="#orgefaa9da">cell</a></li>
<li><a href="#orgecb3ff6">number</a></li>
<li><a href="#orgd80fe11">char</a></li>
<li><a href="#org14e357d">string</a>
<ul>
<li><a href="#org8846060">string</a></li>
<li><a href="#org913b824">string_equal</a></li>
<li><a href="#org6c98032">nat_string_p</a></li>
<li><a href="#orgc576bc6">int_string_p</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org43097e9">jotable</a>
<ul>
<li><a href="#org2683ed2">primitive</a></li>
<li><a href="#org37890b">jo &amp; jojo</a></li>
<li><a href="#orge2193b4">bind &amp; jotable_entry</a></li>
<li><a href="#org4df2297">proto_jotable_entry</a></li>
<li><a href="#org3180cd1">jotable_entry_[occured|entry_used|no_collision]</a></li>
<li><a href="#org5cc2f79">jotable</a></li>
<li><a href="#org8b039a9">string_to_sum</a></li>
<li><a href="#org7574bd4">jotable_keyeq</a></li>
<li><a href="#org72170ab">jotable_hash</a></li>
<li><a href="#org297e8b1">string_area</a></li>
<li><a href="#org8d7f276">copy_to_string_area</a></li>
<li><a href="#org850e069">jotable_insert</a></li>
<li><a href="#org96d6400">jotable_search</a></li>
<li><a href="#org21709e4">jotable_entry_print</a></li>
<li><a href="#org2e9281d">jotable_report_orbit</a></li>
<li><a href="#orga98483b">jotable_report</a></li>
<li><a href="#orgc2ac636">jotable_print</a></li>
<li><a href="#orgbd2e7cb">str2jo &amp; jo2str</a></li>
<li><a href="#org2250041">init_jotable</a></li>
<li><a href="#org5cafff3">jojo_area</a></li>
<li><a href="#orgb99fe9e">here</a>
<ul>
<li><a href="#orgfbe14c">compiling_stack</a></li>
<li><a href="#orge2b2f3b">init_compiling_stack</a></li>
<li><a href="#org19725f7">here</a></li>
</ul>
</li>
<li><a href="#org39f23d">jotable_set_cell</a></li>
<li><a href="#org4974e86">jotable_set_primitive</a></li>
<li><a href="#org33f9a54">jotable_get_cell</a></li>
<li><a href="#orgc456b46">jotable_get_primitive</a></li>
<li><a href="#orgada93e7">jotable_get_jojo</a></li>
<li><a href="#org4102334"><span class="done test">test</span> </a></li>
</ul>
</li>
<li><a href="#org1ebc709">defprim</a>
<ul>
<li><a href="#org16bf76c">defprim_record</a></li>
<li><a href="#org5f139de">defprim_report</a></li>
<li><a href="#org3ac7e7a">defprim</a></li>
</ul>
</li>
<li><a href="#org3e4dcb2">as &amp; rs</a>
<ul>
<li><a href="#orgce3308c">as</a></li>
<li><a href="#orgb4badc7">rs</a></li>
</ul>
</li>
<li><a href="#orgf832597">apply</a>
<ul>
<li><a href="#org4901fbe">apply</a></li>
<li><a href="#org28831e2">p_apply</a></li>
</ul>
</li>
<li><a href="#org6bd566f">eval</a>
<ul>
<li><a href="#org95163bc">eval</a></li>
<li><a href="#orge03a46e">eval_jo</a></li>
<li><a href="#org35b5ca6">eval_key</a></li>
<li><a href="#orgffa7cf3">eval_jojo</a></li>
</ul>
</li>
<li><a href="#org1f40465"><b>stack_operation</b></a>
<ul>
<li><a href="#orgd48faee">p_drop</a></li>
<li><a href="#orgd14e388">p_dup</a></li>
<li><a href="#org35af9bc">p_over</a></li>
<li><a href="#orgfef7d0b">p_tuck</a></li>
<li><a href="#org4ad521b">p_swap</a></li>
<li><a href="#org91da7f4">p_print_stack</a></li>
<li><a href="#org62962ac">p_stack_base</a></li>
<li><a href="#org77ed7a6">p_stack_pointer</a></li>
<li><a href="#org4ff778e">export_stack_operation</a></li>
</ul>
</li>
<li><a href="#orgf9847d2"><b>ending</b></a>
<ul>
<li><a href="#org4af6c93">p_end</a></li>
<li><a href="#orga5576b">p_bye</a></li>
<li><a href="#orgaa4fd9c">export_ending</a></li>
</ul>
</li>
<li><a href="#orgcc1c11e"><b>control</b></a>
<ul>
<li><a href="#orgf94ac5a">p_jump_back</a></li>
<li><a href="#org3a4d6ad">p_jump_over</a></li>
<li><a href="#orgd6c5cba">i_lit</a></li>
<li><a href="#org2d74113">i_tail_call</a></li>
<li><a href="#orgee7ac70">p_jump_if_false</a></li>
<li><a href="#org3d07e5b">export_control</a></li>
</ul>
</li>
<li><a href="#orgdb2e63c"><b>bool</b></a>
<ul>
<li><a href="#orgb0cd12d">p_true</a></li>
<li><a href="#org57dda4b">p_false</a></li>
<li><a href="#org7de8bd9">p_not</a></li>
<li><a href="#orgee62f8e">export_bool</a></li>
</ul>
</li>
<li><a href="#org1e714f0"><b>integer</b></a>
<ul>
<li><a href="#orged20755">p_add</a></li>
<li><a href="#org943604a">p_sub</a></li>
<li><a href="#org3a14892">p_mul</a></li>
<li><a href="#org7ec4764">p_div</a></li>
<li><a href="#orga9912a3">p_mod</a></li>
<li><a href="#org1d7c2bb">p_eq_p</a></li>
<li><a href="#orgc36fcc4">p_gt_p</a></li>
<li><a href="#orgde491eb">p_lt_p</a></li>
<li><a href="#org54ab125">p_gteq_p</a></li>
<li><a href="#orgc58d4d0">p_lteq_p</a></li>
<li><a href="#org9106618">k_integer</a></li>
<li><a href="#org389996">p_print_integer</a></li>
<li><a href="#org167cdb9">p_dot</a></li>
<li><a href="#org3fdce26">export_integer</a></li>
</ul>
</li>
<li><a href="#orge02c22b"><b>memory</b></a>
<ul>
<li><a href="#org8539f4f">p_allocate</a></li>
<li><a href="#org11ba61e">p_free</a></li>
<li><a href="#org848381d">k_var</a></li>
<li><a href="#org27093bd">p_set</a></li>
<li><a href="#org2ead89d">p_get</a></li>
<li><a href="#orgc8cc5ef">export_memory</a></li>
</ul>
</li>
<li><a href="#org4670674">read_char</a>
<ul>
<li><a href="#orgedfef01">reading_stack</a></li>
<li><a href="#orgb242deb">loading_stack</a></li>
<li><a href="#orgfc9e4dc">read_char</a></li>
<li><a href="#org2f9747d">unread_char</a></li>
</ul>
</li>
<li><a href="#org5c36558"><b>jo</b></a>
<ul>
<li><a href="#orgb8459c">alias_add</a></li>
<li><a href="#orgc41508a">alias_find</a></li>
<li><a href="#org1e64ecd">read_jo</a></li>
<li><a href="#org7e374a7">cat_jo</a></li>
<li><a href="#orgc10a5b">p_read_jo</a></li>
<li><a href="#orgc486a94">p_jo_used_p</a></li>
<li><a href="#org5b0cf9e">p_jo_to_string</a></li>
<li><a href="#org686cedb">export_jo</a></li>
</ul>
</li>
<li><a href="#org97c9502"><b>string</b></a>
<ul>
<li><a href="#org461e0dc">k_string</a></li>
<li><a href="#org4ae7990">p_print_string</a></li>
<li><a href="#org1269784">export_string</a></li>
</ul>
</li>
<li><a href="#org29359d7"><b>file</b></a>
<ul>
<li><a href="#orgd354da0">p_read_file</a></li>
<li><a href="#org5547c55">file_readable_p</a></li>
<li><a href="#org581cddd">export_file</a></li>
</ul>
</li>
<li><a href="#org53f6750"><b>keyword</b></a>
<ul>
<li><a href="#orgd9da42a">k_ignore</a></li>
<li><a href="#orgebe0fea">k_if</a>
<ul>
<li><a href="#org68ef8b1"><span class="todo note">note</span> </a></li>
<li><a href="#org9e3cc78">compile_question</a></li>
<li><a href="#orgbf50645">compile_answer</a></li>
<li><a href="#orgeea6814">k_if</a></li>
</ul>
</li>
<li><a href="#org7f116f4">k_else</a></li>
<li><a href="#orgf1e7c0a">k_tail_call</a></li>
<li><a href="#org2e3b6d8">export_keyword</a></li>
</ul>
</li>
<li><a href="#orgc273d3b"><b>system</b></a>
<ul>
<li><a href="#orgb759bae">p_getcwd</a></li>
<li><a href="#orge8b6922">export_system</a></li>
</ul>
</li>
<li><a href="#org231db7d"><b>module</b></a>
<ul>
<li><a href="#orgdeda555">user_module_path</a></li>
<li><a href="#orgcea3a12">system_module_path</a></li>
<li><a href="#org8aa7f22">module_stack</a></li>
<li><a href="#org3533036">load_file</a></li>
<li><a href="#orgbb7af29">find_module</a></li>
<li><a href="#orgd784753">load_module</a></li>
<li><a href="#org93839e3">k_import</a>
<ul>
<li><a href="#org7e6d030">k_add_alias</a></li>
<li><a href="#orgcfd5d60">k_one_module</a></li>
<li><a href="#org7bdc074">k_import</a></li>
</ul>
</li>
<li><a href="#org1d8610a">export_module</a></li>
</ul>
</li>
<li><a href="#orgfde8c"><b>ffi</b></a>
<ul>
<li><a href="#orgbe0cb46">get_clib</a></li>
<li><a href="#orgfafd2e4">ccall</a></li>
<li><a href="#org74f2c36">k_clib</a></li>
<li><a href="#orga79e152">export_ffi</a></li>
</ul>
</li>
<li><a href="#org277ab63"><b>top_level</b></a>
<ul>
<li><a href="#orga0784d7">read_alias_jo</a></li>
<li><a href="#org76c3afa">defun_record</a></li>
<li><a href="#org23e26fb">k_defun</a></li>
<li><a href="#orgfe41c82"><span class="todo _gt__lt_">&gt;&lt;</span> k_declare</a></li>
<li><a href="#org7f28cb0">k_run</a></li>
<li><a href="#orgc4aa5d5">defvar_record</a></li>
<li><a href="#org39d1d67">p_defvar_record</a></li>
<li><a href="#org5eb95aa">k_defvar</a></li>
<li><a href="#org761f7f3">p_top_repl</a></li>
<li><a href="#org5530aeb">export_top_level</a></li>
</ul>
</li>
<li><a href="#org2c8dd6b"><b>misc</b></a>
<ul>
<li><a href="#orgc0a30c0">do_nothing</a></li>
<li><a href="#org668a01a">p_round_bar</a></li>
<li><a href="#org541d00c">p_cell_size</a></li>
<li><a href="#org935114b">p_newline</a></li>
<li><a href="#org9dc0a44">export_mise</a></li>
</ul>
</li>
<li><a href="#orga12ab1e"><b>play</b></a>
<ul>
<li><a href="#org103d086">p1</a></li>
<li><a href="#orgf8af4c1">p2</a></li>
<li><a href="#orgd95f1cf">p3</a></li>
<li><a href="#org8cd2408">export_play</a></li>
</ul>
</li>
<li><a href="#org18037b0">epilog</a>
<ul>
<li><a href="#org6dbaf84">run_basic_repl</a></li>
<li><a href="#org6ac1235">main</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr  />

<ul class="org-ul">
<li><p>the implementation of the interpreter (<a href="https://github.com/xieyuheng/jojo">source</a>)</p></li></ul>

<hr  />

<div id="outline-container-org9ed3b31" class="outline-2">
<h2 id="org9ed3b31"><span class="done todo">todo</span> </h2>
<div class="outline-text-2" id="text-org9ed3b31">
<ul class="org-ul">
<li><p>maintain a record for</p><p><ul class="org-ul"></p><p><li><p>defprim</p></li></p><p><li><p>defun</p></li></p><p><li><p>defvar</p></li></ul></p></li>
<li><p>better structure of code</p></li>
<li><p>export the syntax extension mechanism to jojo</p><p>syntax for list</p></li>
<li><p>print-stack for run</p></li>
<li><p>no re-define</p><p>no use before define</p></li>
<li><p>better jotable for being compiler target</p></li>
<li><p>debug</p></li>
<li><p>fix jump</p></li>
<li><p>error report for every limited number</p></li></ul>
</div>
</div>

<div id="outline-container-org73546d6" class="outline-2">
<h2 id="org73546d6">helper</h2>
<div class="outline-text-2" id="text-org73546d6">
</div><div id="outline-container-org380035f" class="outline-3">
<h3 id="org380035f">header</h3>
<div class="outline-text-3" id="text-org380035f">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #a6e22e;">#include</span> <span style="color: #e6db74;">&lt;stdio.h&gt;</span>
<span style="color: #a6e22e;">#include</span> <span style="color: #e6db74;">&lt;ctype.h&gt;</span>
<span style="color: #a6e22e;">#include</span> <span style="color: #e6db74;">&lt;stdlib.h&gt;</span>
<span style="color: #a6e22e;">#include</span> <span style="color: #e6db74;">&lt;stdint.h&gt;</span>
<span style="color: #a6e22e;">#include</span> <span style="color: #e6db74;">&lt;setjmp.h&gt;</span>
<span style="color: #a6e22e;">#include</span> <span style="color: #e6db74;">&lt;string.h&gt;</span>
<span style="color: #a6e22e;">#include</span> <span style="color: #e6db74;">&lt;dlfcn.h&gt;</span>
<span style="color: #a6e22e;">#include</span> <span style="color: #e6db74;">&lt;unistd.h&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge191bc9" class="outline-3">
<h3 id="orge191bc9">bool</h3>
<div class="outline-text-3" id="text-orge191bc9">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #f92672; font-weight: bold;">enum</span> { <span style="color: #ae81ff;">false</span>, <span style="color: #ae81ff;">true</span> } <span style="color: #66d9ef; font-weight: bold;">bool</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgefaa9da" class="outline-3">
<h3 id="orgefaa9da">cell</h3>
<div class="outline-text-3" id="text-orgefaa9da">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #66d9ef; font-weight: bold;">intptr_t</span> <span style="color: #66d9ef; font-weight: bold;">cell</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgecb3ff6" class="outline-3">
<h3 id="orgecb3ff6">number</h3>
<div class="outline-text-3" id="text-orgecb3ff6">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #a6e22e;">max</span>(<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span>, <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span>) {
  <span style="color: #f92672; font-weight: bold;">if</span> (a &lt; b) {
    <span style="color: #f92672; font-weight: bold;">return</span> b;
  }
  <span style="color: #f92672; font-weight: bold;">else</span> {
    <span style="color: #f92672; font-weight: bold;">return</span> a;
  }
}

<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #a6e22e;">min</span>(<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span>, <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span>) {
  <span style="color: #f92672; font-weight: bold;">if</span> (a &gt; b) {
    <span style="color: #f92672; font-weight: bold;">return</span> b;
  }
  <span style="color: #f92672; font-weight: bold;">else</span> {
    <span style="color: #f92672; font-weight: bold;">return</span> a;
  }
}
</pre>
</div>
</div>
</div>
