jojo.html

<div id="outline-container-orgd80fe11" class="outline-3">
<h3 id="orgd80fe11">char</h3>
<div class="outline-text-3" id="text-orgd80fe11">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">isbarcket</span>(<span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">c</span>) {
  <span style="color: #f92672; font-weight: bold;">return</span> (c == <span style="color: #e6db74;">'('</span> ||
          c == <span style="color: #e6db74;">')'</span> ||
          c == <span style="color: #e6db74;">'['</span> ||
          c == <span style="color: #e6db74;">']'</span> ||
          c == <span style="color: #e6db74;">'{'</span> ||
          c == <span style="color: #e6db74;">'}'</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org14e357d" class="outline-3">
<h3 id="org14e357d">string</h3>
<div class="outline-text-3" id="text-org14e357d">
</div><div id="outline-container-org8846060" class="outline-4">
<h4 id="org8846060">string</h4>
<div class="outline-text-4" id="text-org8846060">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #66d9ef; font-weight: bold;">char</span>* <span style="color: #66d9ef; font-weight: bold;">string</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org913b824" class="outline-4">
<h4 id="org913b824">string_equal</h4>
<div class="outline-text-4" id="text-org913b824">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">string_equal</span>(<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">s1</span>, <span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">s2</span>) {
  <span style="color: #f92672; font-weight: bold;">if</span> (strcmp(s1, s2) == 0) {
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">true</span>;
  }
  <span style="color: #f92672; font-weight: bold;">else</span> {
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">false</span>;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c98032" class="outline-4">
<h4 id="org6c98032">nat_string_p</h4>
<div class="outline-text-4" id="text-org6c98032">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">nat_string_p</span>(<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">str</span>) {
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">i</span> = 0;
  <span style="color: #f92672; font-weight: bold;">while</span> (str[i] != 0) {
    <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #960050;">!</span>isdigit(str[i])) {
      <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">false</span>;
      }
    i++;
  }
  <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">true</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc576bc6" class="outline-4">
<h4 id="orgc576bc6">int_string_p</h4>
<div class="outline-text-4" id="text-orgc576bc6">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">int_string_p</span>(<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">str</span>) {
  <span style="color: #f92672; font-weight: bold;">if</span> (str[0] == <span style="color: #e6db74;">'-'</span> ||
      str[0] == <span style="color: #e6db74;">'+'</span>) {
    <span style="color: #f92672; font-weight: bold;">return</span> nat_string_p(str + 1);
  }
  <span style="color: #f92672; font-weight: bold;">else</span> {
    <span style="color: #f92672; font-weight: bold;">return</span> nat_string_p(str);
  }
}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org43097e9" class="outline-2">
<h2 id="org43097e9">jotable</h2>
<div class="outline-text-2" id="text-org43097e9">
</div><div id="outline-container-org2683ed2" class="outline-3">
<h3 id="org2683ed2">primitive</h3>
<div class="outline-text-3" id="text-org2683ed2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #66d9ef; font-weight: bold;">void</span> (*<span style="color: #66d9ef; font-weight: bold;">primitive</span>)();
</pre>
</div>
</div>
</div>

<div id="outline-container-org37890b" class="outline-3">
<h3 id="org37890b">jo &amp; jojo</h3>
<div class="outline-text-3" id="text-org37890b">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #66d9ef; font-weight: bold;">jo</span>;

<span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #f92672; font-weight: bold;">struct</span> {
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">size</span>;
  <span style="color: #66d9ef; font-weight: bold;">jo</span> *<span style="color: #fd971f;">array</span>;
} <span style="color: #66d9ef; font-weight: bold;">jojo</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2193b4" class="outline-3">
<h3 id="orge2193b4">bind &amp; jotable_entry</h3>
<div class="outline-text-3" id="text-orge2193b4">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #f92672; font-weight: bold;">union</span> {
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">cell</span>;
  <span style="color: #66d9ef; font-weight: bold;">primitive</span> <span style="color: #fd971f;">primitive</span>;
  <span style="color: #66d9ef; font-weight: bold;">jojo</span> <span style="color: #fd971f;">jojo</span>;
} <span style="color: #66d9ef; font-weight: bold;">bind</span>;

<span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #f92672; font-weight: bold;">struct</span> {
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">index</span>;
  <span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">key</span>;
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">type</span>;
  <span style="color: #66d9ef; font-weight: bold;">bind</span> <span style="color: #fd971f;">value</span>;
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">orbit_length</span>;
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">orbiton</span>;
} <span style="color: #66d9ef; font-weight: bold;">jotable_entry</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org4df2297" class="outline-3">
<h3 id="org4df2297">proto_jotable_entry</h3>
<div class="outline-text-3" id="text-org4df2297">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #a6e22e;">str2jo</span> (<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">str</span>);

<span style="color: #66d9ef; font-weight: bold;">jotable_entry</span> <span style="color: #a6e22e;">proto_jotable_entry</span>(<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">index</span>) {
  <span style="color: #66d9ef; font-weight: bold;">jotable_entry</span> <span style="color: #fd971f;">e</span> = {
    .index = index,
    .key = 0,
    .type = str2jo(<span style="color: #e6db74;">"none"</span>),
    .value.cell = 0,
    .orbit_length = 0,
    .orbiton = 0
  };
  <span style="color: #f92672; font-weight: bold;">return</span> e;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3180cd1" class="outline-3">
<h3 id="org3180cd1">jotable_entry_[occured|entry_used|no_collision]</h3>
<div class="outline-text-3" id="text-org3180cd1">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">jotable_entry_occured</span>(<span style="color: #66d9ef; font-weight: bold;">jotable_entry</span> <span style="color: #fd971f;">e</span>) {
  <span style="color: #f92672; font-weight: bold;">return</span> e.key != 0;
}

<span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">jotable_entry_used</span>(<span style="color: #66d9ef; font-weight: bold;">jotable_entry</span> <span style="color: #fd971f;">e</span>) {
  <span style="color: #f92672; font-weight: bold;">return</span> e.type != str2jo(<span style="color: #e6db74;">"none"</span>);
}

<span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">jotable_entry_no_collision</span>(<span style="color: #66d9ef; font-weight: bold;">jotable_entry</span> <span style="color: #fd971f;">e</span>) {
  <span style="color: #f92672; font-weight: bold;">return</span> e.index == e.orbiton;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5cc2f79" class="outline-3">
<h3 id="org5cc2f79">jotable</h3>
<div class="outline-text-3" id="text-org5cc2f79">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #FF8888;">// </span><span style="color: #FF8888;">prime table size</span>
<span style="color: #FF8888;">//   </span><span style="color: #FF8888;">1000003   about 976 k</span>
<span style="color: #FF8888;">//   </span><span style="color: #FF8888;">1000033</span>
<span style="color: #FF8888;">//   </span><span style="color: #FF8888;">1000333</span>
<span style="color: #FF8888;">//   </span><span style="color: #FF8888;">100003    about 97 k</span>
<span style="color: #FF8888;">//   </span><span style="color: #FF8888;">100333</span>
<span style="color: #FF8888;">//   </span><span style="color: #FF8888;">997</span>
<span style="color: #a6e22e;">#define</span> <span style="color: #fd971f;">jotable_size</span> 100003
<span style="color: #66d9ef; font-weight: bold;">jotable_entry</span> <span style="color: #fd971f;">jotable</span>[jotable_size];
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">jotable_counter</span> = 0;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b039a9" class="outline-3">
<h3 id="org8b039a9">string_to_sum</h3>
<div class="outline-text-3" id="text-org8b039a9">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #a6e22e;">string_to_sum</span>(<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">str</span>) {
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">sum</span> = 0;
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">max_step</span> = 10;
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">i</span> = 0;
  <span style="color: #f92672; font-weight: bold;">while</span> (i &lt; strlen(str)) {
    sum = sum + str[i] * (2 &lt;&lt; min(i, max_step));
    i++;
  }
  <span style="color: #f92672; font-weight: bold;">return</span> sum;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7574bd4" class="outline-3">
<h3 id="org7574bd4">jotable_keyeq</h3>
<div class="outline-text-3" id="text-org7574bd4">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">jotable_keyeq</span>(<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">k1</span>, <span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">k2</span>) {
  <span style="color: #f92672; font-weight: bold;">return</span> string_equal(k1, k2);
}
</pre>
</div>
</div>
</div>
