jojo.html

<div id="outline-container-org72170ab" class="outline-3">
<h3 id="org72170ab">jotable_hash</h3>
<div class="outline-text-3" id="text-org72170ab">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #a6e22e;">jotable_hash</span>(<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">key</span>, <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">counter</span>) {
  <span style="color: #f92672; font-weight: bold;">return</span> (counter + string_to_sum(key)) % jotable_size;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org297e8b1" class="outline-3">
<h3 id="org297e8b1">string_area</h3>
<div class="outline-text-3" id="text-org297e8b1">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">string_area</span>[4 * 1024 * 1024];
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">string_area_counter</span> = 0;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8d7f276" class="outline-3">
<h3 id="org8d7f276">copy_to_string_area</h3>
<div class="outline-text-3" id="text-org8d7f276">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #a6e22e;">copy_to_string_area</span>(<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">str</span>) {
  <span style="color: #66d9ef; font-weight: bold;">char</span> *<span style="color: #fd971f;">str1</span>;
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">i</span> = 0;
  str1 = (string_area + string_area_counter);
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #f92672; font-weight: bold;">if</span> (str[i] == 0) {
      str1[i] = str[i];
      i++;
      <span style="color: #f92672; font-weight: bold;">break</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      str1[i] = str[i];
      i++;
    }
  }
  string_area_counter = i + string_area_counter;
  <span style="color: #f92672; font-weight: bold;">return</span> str1;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org850e069" class="outline-3">
<h3 id="org850e069">jotable_insert</h3>
<div class="outline-text-3" id="text-org850e069">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #FF8888;">// </span><span style="color: #FF8888;">-1 denotes the hash_table is filled</span>
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #a6e22e;">jotable_insert</span>(<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">key</span>) {
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">orbit_index</span> = jotable_hash(key, 0);
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">counter</span> = 0;
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">index</span> = jotable_hash(key, counter);
    <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #960050;">!</span>jotable_entry_occured(jotable[index])) {
      key = copy_to_string_area(key);
      jotable[index].key = key;
      jotable[index].orbiton = orbit_index;
      jotable[orbit_index].orbit_length = 1 + counter;
      jotable_counter = 1 + jotable_counter;
      <span style="color: #f92672; font-weight: bold;">return</span> index;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (jotable_keyeq(key, jotable[index].key)) {
      <span style="color: #f92672; font-weight: bold;">return</span> index;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (counter == jotable_size) {
      <span style="color: #f92672; font-weight: bold;">return</span> -1;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      counter = 1 + counter;
    }
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org96d6400" class="outline-3">
<h3 id="org96d6400">jotable_search</h3>
<div class="outline-text-3" id="text-org96d6400">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #FF8888;">// </span><span style="color: #FF8888;">-1 denotes key not occured</span>
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #a6e22e;">jotable_search</span>(<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">key</span>) {
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">counter</span> = 0;
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">index</span> = jotable_hash(key, counter);
    <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #960050;">!</span>jotable_entry_occured(jotable[index])) {
      <span style="color: #f92672; font-weight: bold;">return</span> -1;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (jotable_keyeq(key, jotable[index].key)) {
      <span style="color: #f92672; font-weight: bold;">return</span> index;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (counter == jotable_size) {
      <span style="color: #f92672; font-weight: bold;">return</span> -1;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      counter = 1 + counter;
    }
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org21709e4" class="outline-3">
<h3 id="org21709e4">jotable_entry_print</h3>
<div class="outline-text-3" id="text-org21709e4">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #a6e22e;">jo2str</span> (<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">index</span>);

<span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">jotable_entry_print</span>(<span style="color: #66d9ef; font-weight: bold;">jotable_entry</span> <span style="color: #fd971f;">entry</span>) {
  printf(<span style="color: #e6db74;">"%s : "</span>, jo2str(entry.type));
  <span style="color: #f92672; font-weight: bold;">if</span> (entry.type == str2jo(<span style="color: #e6db74;">"cell"</span>)) {
    printf(<span style="color: #e6db74;">"%ld"</span>, entry.value.cell);
  }
  <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (entry.type == str2jo(<span style="color: #e6db74;">"primitive"</span>)) {
    printf(<span style="color: #e6db74;">"%ld"</span>, entry.value.primitive);
  }
  <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (entry.type == str2jo(<span style="color: #e6db74;">"jojo"</span>)) {
    printf(<span style="color: #e6db74;">"%ld "</span>, entry.value.jojo.size);
    printf(<span style="color: #e6db74;">"[ "</span>, entry.value.jojo.size);
    <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">i</span>;
    <span style="color: #f92672; font-weight: bold;">for</span> (i=0; i &lt; entry.value.jojo.size; i=i+1) {
      printf(<span style="color: #e6db74;">"%ld "</span>, entry.value.jojo.array[i]);
    }
    printf(<span style="color: #e6db74;">"]"</span>, entry.value.jojo.size);
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e9281d" class="outline-3">
<h3 id="org2e9281d">jotable_report_orbit</h3>
<div class="outline-text-3" id="text-org2e9281d">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">jotable_report_orbit</span>(<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">index</span>, <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">counter</span>) {
  <span style="color: #f92672; font-weight: bold;">while</span> (counter &lt; jotable[index].orbit_length) {
    <span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">key</span> = jotable[index].key;
    <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">next_index</span> = jotable_hash(key, counter);
    <span style="color: #f92672; font-weight: bold;">if</span> (index == jotable[next_index].orbiton) {
      printf(<span style="color: #e6db74;">"  - %ld %s\n"</span>, next_index, jotable[next_index].key);
    }
    <span style="color: #f92672; font-weight: bold;">if</span> (jotable_entry_used(jotable[next_index])) {
      printf(<span style="color: #e6db74;">"    = "</span>);
      jotable_entry_print(jotable[next_index]);
      printf(<span style="color: #e6db74;">"\n"</span>);
    }
    counter = 1 + counter;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga98483b" class="outline-3">
<h3 id="orga98483b">jotable_report</h3>
<div class="outline-text-3" id="text-orga98483b">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">jotable_report</span>() {
  printf(<span style="color: #e6db74;">"\n"</span>);
  printf(<span style="color: #e6db74;">"- jotable_report\n"</span>);
  printf(<span style="color: #e6db74;">"  : &lt;index&gt; &lt;key&gt; // &lt;orbit-length&gt;\n"</span>);
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">index</span> = 0;
  <span style="color: #f92672; font-weight: bold;">while</span> (index &lt; jotable_size) {
    <span style="color: #f92672; font-weight: bold;">if</span> (jotable_entry_occured(jotable[index]) &amp;&amp;
        jotable_entry_no_collision(jotable[index])) {
      printf(<span style="color: #e6db74;">"  - %ld %s // %ld\n"</span>,
             index, jotable[index].key, jotable[index].orbit_length);
      <span style="color: #f92672; font-weight: bold;">if</span> (jotable_entry_used(jotable[index])) {
        printf(<span style="color: #e6db74;">"    = "</span>);
        jotable_entry_print(jotable[index]);
        printf(<span style="color: #e6db74;">"\n"</span>);
      }
      jotable_report_orbit(index, 1);
    }
    index = 1 + index;
  }
  printf(<span style="color: #e6db74;">"  : &lt;index&gt; &lt;key&gt; // &lt;orbit-length&gt;\n"</span>);
  printf(<span style="color: #e6db74;">"\n"</span>);
  printf(<span style="color: #e6db74;">"- used : %ld\n"</span>, jotable_counter);
  printf(<span style="color: #e6db74;">"- free : %ld\n"</span>, jotable_size - jotable_counter);
}
</pre>
</div>
</div>
</div>
