jojo.org
*** jotable_print

    #+begin_src c
    void jotable_print() {
      printf("\n");
      printf("- jotable_print\n");
      cell index = 0;
      while (index < jotable_size) {
        printf("  - %ld %s %ld // %ld\n",
               index,
               jotable[index].key,
               jotable[index].value,
               jotable[index].orbit_length);
        index = 1 + index;
      }
      printf("\n");
      printf("- used : %ld\n", jotable_counter);
      printf("- free : %ld\n", jotable_size - jotable_counter);
    }
    #+end_src

*** str2jo & jo2str

    #+begin_src c
    jo str2jo(string str) {
      return jotable_insert(str);
    }

    string jo2str(cell index) {
      return jotable[index].key;
    }
    #+end_src

*** init_jotable

    #+begin_src c
    void init_jotable() {
      cell i = 0;
      while (i < jotable_size) {
        jotable[i] = proto_jotable_entry(i);
        i++;
      }
    }
    #+end_src

*** jojo_area

    #+begin_src c
    jo jojo_area[1024 * 1024];
    #+end_src

*** here

***** compiling_stack

      #+begin_src c
      typedef jo* compiling_stack_t[1024];

      compiling_stack_t compiling_stack;
      cell compiling_stack_base = 0;
      cell compiling_stack_pointer = 0;

      void compiling_stack_push(jo* value) {
        compiling_stack[compiling_stack_pointer] = value;
        compiling_stack_pointer++;
      }

      jo* compiling_stack_pop() {
        compiling_stack_pointer--;
        return compiling_stack[compiling_stack_pointer];
      }

      void compiling_stack_inc() {
        compiling_stack[compiling_stack_pointer - 1] =
          compiling_stack[compiling_stack_pointer - 1] + 1;
      }


      jo* compiling_stack_tos() {
        return compiling_stack[compiling_stack_pointer - 1];
      }

      bool compiling_stack_empty_p() {
        return compiling_stack_pointer == compiling_stack_base;
      }
      #+end_src

***** init_compiling_stack

      #+begin_src c
      void init_compiling_stack() {
        compiling_stack_push(jojo_area);
      }
      #+end_src

***** here

      #+begin_src c
      void here(cell n) {
        jo* pointer = compiling_stack_pop();
        pointer[0] = n;
        compiling_stack_push(pointer + 1);
      }
      #+end_src

*** jotable_set_cell

    #+begin_src c
    void jotable_set_cell(cell index, cell cell) {
      jotable[index].type = str2jo("cell");
      jotable[index].value.cell = cell;
    }
    #+end_src

*** jotable_set_primitive

    #+begin_src c
    void jotable_set_primitive(cell index, primitive primitive) {
      jotable[index].type = str2jo("primitive");
      jotable[index].value.primitive = primitive;
    }
    #+end_src

*** jotable_get_cell

    #+begin_src c
    cell jotable_get_cell(cell index) {
      return jotable[index].value.cell;
    }
    #+end_src

*** jotable_get_primitive

    #+begin_src c
    primitive jotable_get_primitive(cell index) {
      return jotable[index].value.primitive;
    }
    #+end_src

*** jotable_get_jojo

    #+begin_src c
    jojo jotable_get_jojo(cell index) {
      return jotable[index].value.jojo;
    }
    #+end_src

*** test

    #+begin_src c
    void jotable_test() {
      str2jo("testkey0");
      str2jo("testkey1");
      str2jo("testkey2");
      str2jo("testkey3");
      str2jo("testkey4");

      str2jo("testkey0");
      str2jo("testkey1");
      str2jo("testkey2");
      str2jo("testkey3");
      str2jo("testkey4");

      str2jo("testtestkey0");
      str2jo("testtestkey1");
      str2jo("testtestkey2");
      str2jo("testtestkey3");
      str2jo("testtestkey4");

      str2jo("testtesttestkey0");
      str2jo("testtesttestkey1");
      str2jo("testtesttestkey2");
      str2jo("testtesttestkey3");
      str2jo("testtesttestkey4");

      str2jo("testtesttesttestkey0");
      str2jo("testtesttesttestkey1");
      str2jo("testtesttesttestkey2");
      str2jo("testtesttesttestkey3");
      str2jo("testtesttesttestkey4");

      jotable_set_cell(str2jo("k1"), 1);
      jotable_report();

      jotable_set_cell(str2jo("k1"), 0);
      jotable_report();

      // jotable_print();
    }
    #+end_src

* defprim

