jojo.html

<div id="outline-container-orgc2ac636" class="outline-3">
<h3 id="orgc2ac636">jotable_print</h3>
<div class="outline-text-3" id="text-orgc2ac636">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">jotable_print</span>() {
  printf(<span style="color: #e6db74;">"\n"</span>);
  printf(<span style="color: #e6db74;">"- jotable_print\n"</span>);
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">index</span> = 0;
  <span style="color: #f92672; font-weight: bold;">while</span> (index &lt; jotable_size) {
    printf(<span style="color: #e6db74;">"  - %ld %s %ld // %ld\n"</span>,
           index,
           jotable[index].key,
           jotable[index].value,
           jotable[index].orbit_length);
    index = 1 + index;
  }
  printf(<span style="color: #e6db74;">"\n"</span>);
  printf(<span style="color: #e6db74;">"- used : %ld\n"</span>, jotable_counter);
  printf(<span style="color: #e6db74;">"- free : %ld\n"</span>, jotable_size - jotable_counter);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd2e7cb" class="outline-3">
<h3 id="orgbd2e7cb">str2jo &amp; jo2str</h3>
<div class="outline-text-3" id="text-orgbd2e7cb">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #a6e22e;">str2jo</span>(<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">str</span>) {
  <span style="color: #f92672; font-weight: bold;">return</span> jotable_insert(str);
}

<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #a6e22e;">jo2str</span>(<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">index</span>) {
  <span style="color: #f92672; font-weight: bold;">return</span> jotable[index].key;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2250041" class="outline-3">
<h3 id="org2250041">init_jotable</h3>
<div class="outline-text-3" id="text-org2250041">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">init_jotable</span>() {
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">i</span> = 0;
  <span style="color: #f92672; font-weight: bold;">while</span> (i &lt; jotable_size) {
    jotable[i] = proto_jotable_entry(i);
    i++;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5cafff3" class="outline-3">
<h3 id="org5cafff3">jojo_area</h3>
<div class="outline-text-3" id="text-org5cafff3">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">jojo_area</span>[1024 * 1024];
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb99fe9e" class="outline-3">
<h3 id="orgb99fe9e">here</h3>
<div class="outline-text-3" id="text-orgb99fe9e">
</div><div id="outline-container-orgfbe14c" class="outline-4">
<h4 id="orgfbe14c">compiling_stack</h4>
<div class="outline-text-4" id="text-orgfbe14c">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #66d9ef; font-weight: bold;">compiling_stack_t</span>[1024];

<span style="color: #66d9ef; font-weight: bold;">compiling_stack_t</span> <span style="color: #fd971f;">compiling_stack</span>;
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">compiling_stack_base</span> = 0;
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">compiling_stack_pointer</span> = 0;

<span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">compiling_stack_push</span>(<span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #fd971f;">value</span>) {
  compiling_stack[compiling_stack_pointer] = value;
  compiling_stack_pointer++;
}

<span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #a6e22e;">compiling_stack_pop</span>() {
  compiling_stack_pointer--;
  <span style="color: #f92672; font-weight: bold;">return</span> compiling_stack[compiling_stack_pointer];
}

<span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">compiling_stack_inc</span>() {
  compiling_stack[compiling_stack_pointer - 1] =
    compiling_stack[compiling_stack_pointer - 1] + 1;
}


<span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #a6e22e;">compiling_stack_tos</span>() {
  <span style="color: #f92672; font-weight: bold;">return</span> compiling_stack[compiling_stack_pointer - 1];
}

<span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">compiling_stack_empty_p</span>() {
  <span style="color: #f92672; font-weight: bold;">return</span> compiling_stack_pointer == compiling_stack_base;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2b2f3b" class="outline-4">
<h4 id="orge2b2f3b">init_compiling_stack</h4>
<div class="outline-text-4" id="text-orge2b2f3b">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">init_compiling_stack</span>() {
  compiling_stack_push(jojo_area);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org19725f7" class="outline-4">
<h4 id="org19725f7">here</h4>
<div class="outline-text-4" id="text-org19725f7">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">here</span>(<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">n</span>) {
  <span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #fd971f;">pointer</span> = compiling_stack_pop();
  pointer[0] = n;
  compiling_stack_push(pointer + 1);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org39f23d" class="outline-3">
<h3 id="org39f23d">jotable_set_cell</h3>
<div class="outline-text-3" id="text-org39f23d">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">jotable_set_cell</span>(<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">index</span>, <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">cell</span>) {
  jotable[index].type = str2jo(<span style="color: #e6db74;">"cell"</span>);
  jotable[index].value.cell = cell;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4974e86" class="outline-3">
<h3 id="org4974e86">jotable_set_primitive</h3>
<div class="outline-text-3" id="text-org4974e86">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">jotable_set_primitive</span>(<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">index</span>, <span style="color: #66d9ef; font-weight: bold;">primitive</span> <span style="color: #fd971f;">primitive</span>) {
  jotable[index].type = str2jo(<span style="color: #e6db74;">"primitive"</span>);
  jotable[index].value.primitive = primitive;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org33f9a54" class="outline-3">
<h3 id="org33f9a54">jotable_get_cell</h3>
<div class="outline-text-3" id="text-org33f9a54">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #a6e22e;">jotable_get_cell</span>(<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">index</span>) {
  <span style="color: #f92672; font-weight: bold;">return</span> jotable[index].value.cell;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc456b46" class="outline-3">
<h3 id="orgc456b46">jotable_get_primitive</h3>
<div class="outline-text-3" id="text-orgc456b46">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">primitive</span> <span style="color: #a6e22e;">jotable_get_primitive</span>(<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">index</span>) {
  <span style="color: #f92672; font-weight: bold;">return</span> jotable[index].value.primitive;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgada93e7" class="outline-3">
<h3 id="orgada93e7">jotable_get_jojo</h3>
<div class="outline-text-3" id="text-orgada93e7">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">jojo</span> <span style="color: #a6e22e;">jotable_get_jojo</span>(<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">index</span>) {
  <span style="color: #f92672; font-weight: bold;">return</span> jotable[index].value.jojo;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4102334" class="outline-3">
<h3 id="org4102334"><span class="done test">test</span> </h3>
<div class="outline-text-3" id="text-org4102334">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">jotable_test</span>() {
  str2jo(<span style="color: #e6db74;">"testkey0"</span>);
  str2jo(<span style="color: #e6db74;">"testkey1"</span>);
  str2jo(<span style="color: #e6db74;">"testkey2"</span>);
  str2jo(<span style="color: #e6db74;">"testkey3"</span>);
  str2jo(<span style="color: #e6db74;">"testkey4"</span>);

  str2jo(<span style="color: #e6db74;">"testkey0"</span>);
  str2jo(<span style="color: #e6db74;">"testkey1"</span>);
  str2jo(<span style="color: #e6db74;">"testkey2"</span>);
  str2jo(<span style="color: #e6db74;">"testkey3"</span>);
  str2jo(<span style="color: #e6db74;">"testkey4"</span>);

  str2jo(<span style="color: #e6db74;">"testtestkey0"</span>);
  str2jo(<span style="color: #e6db74;">"testtestkey1"</span>);
  str2jo(<span style="color: #e6db74;">"testtestkey2"</span>);
  str2jo(<span style="color: #e6db74;">"testtestkey3"</span>);
  str2jo(<span style="color: #e6db74;">"testtestkey4"</span>);

  str2jo(<span style="color: #e6db74;">"testtesttestkey0"</span>);
  str2jo(<span style="color: #e6db74;">"testtesttestkey1"</span>);
  str2jo(<span style="color: #e6db74;">"testtesttestkey2"</span>);
  str2jo(<span style="color: #e6db74;">"testtesttestkey3"</span>);
  str2jo(<span style="color: #e6db74;">"testtesttestkey4"</span>);

  str2jo(<span style="color: #e6db74;">"testtesttesttestkey0"</span>);
  str2jo(<span style="color: #e6db74;">"testtesttesttestkey1"</span>);
  str2jo(<span style="color: #e6db74;">"testtesttesttestkey2"</span>);
  str2jo(<span style="color: #e6db74;">"testtesttesttestkey3"</span>);
  str2jo(<span style="color: #e6db74;">"testtesttesttestkey4"</span>);

  jotable_set_cell(str2jo(<span style="color: #e6db74;">"k1"</span>), 1);
  jotable_report();

  jotable_set_cell(str2jo(<span style="color: #e6db74;">"k1"</span>), 0);
  jotable_report();

  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">jotable_print();</span>
}
</pre>
</div>
</div>
</div>
</div>
