jojo.org
*** defprim_record

    #+begin_src c
    jo defprim_record[64 * 1024];
    cell defprim_record_counter = 0;
    #+end_src

*** defprim_report

    #+begin_src c
    void defprim_report() {
      printf("- defprim_report :\n");
      cell i = 0;
      while (i < defprim_record_counter) {
        printf("  %s\n", jo2str(defprim_record[i]));
        i++;
      }
    }
    #+end_src

*** defprim

    #+begin_src c
    void defprim(string str, primitive fun) {
      jo index = str2jo(str);
      defprim_record[defprim_record_counter] = index;
      defprim_record_counter++;
      defprim_record[defprim_record_counter] = 0;
      jotable_set_primitive(index, fun);
    }
    #+end_src

* as & rs

*** as

    #+begin_src c
    typedef cell argument_stack[1024 * 4];

    argument_stack as;
    cell as_base = 64;
    cell as_pointer = 64;

    void as_push(cell value) {
      as[as_pointer] = value;
      as_pointer++;
    }

    cell as_pop() {
      as_pointer--;
      return as[as_pointer];
    }
    #+end_src

*** rs

    #+begin_src c
    typedef jo* return_stack[1024 * 4];

    return_stack rs;
    cell rs_base = 64;
    cell rs_pointer = 64;

    void rs_push(jo* value) {
      rs[rs_pointer] = value;
      rs_pointer++;
    }

    jo* rs_pop() {
      rs_pointer--;
      return rs[rs_pointer];
    }
    #+end_src

* apply

*** apply

    - be careful when calling this function in primitive
      because after rs_push a jojo
      one need to exit current primitive to run the jojo

    #+begin_src c
    void apply(jo jo) {
      if (!jotable_entry_used(jotable[jo])) {
        printf("undefined jo : %s\n", jo2str(jo));
        return;
      }
      cell jo_type = jotable[jo].type;
      if (jo_type == str2jo("primitive")) {
        primitive primitive = jotable_get_primitive(jo);
        primitive();
      }
      else if (jo_type == str2jo("jojo")) {
        jojo jojo = jotable_get_jojo(jo);
        rs_push(jojo.array);
      }
      else if (jo_type == str2jo("cell")) {
        cell cell = jotable_get_cell(jo);
        as_push(cell);
      }
    }
    #+end_src

*** p_apply

    #+begin_src c
    void p_apply() {
      apply(as_pop());
    }
    #+end_src

* eval

*** eval

    #+begin_src c
    jmp_buf jmp_buffer;

    bool exit_eval() {
      longjmp(jmp_buffer, 666);
    }

    void eval() {
      if (666 == setjmp(jmp_buffer)) {
        return;
      }
      else {
        cell rs_base = rs_pointer;
        while (rs_pointer >= rs_base) {
          jo* function_body = rs_pop();
          rs_push(function_body + 1);
          cell jo = *(cell*)function_body;
          apply(jo);
        }
      }
    }
    #+end_src

*** eval_jo

    #+begin_src c
    void eval_jo(jo jo) {
      cell jo_type = jotable[jo].type;
      if (jo_type == str2jo("primitive")) {
        primitive primitive = jotable_get_primitive(jo);
        primitive();
      }
      else if (jo_type == str2jo("jojo")) {
        jojo jojo = jotable_get_jojo(jo);
        rs_push(jojo.array);
        eval();
      }
      else if (jo_type == str2jo("cell")) {
        cell cell = jotable_get_cell(jo);
        as_push(cell);
      }
    }
    #+end_src

*** eval_key

    #+begin_src c
    void eval_key(jo jo) {
      if (!jotable_entry_used(jotable[jo])) {
        printf("undefined keyword : %s\n", jo2str(jo));
        k_ignore();
        return;
      }
      eval_jo(jo);
    }
    #+end_src

*** eval_jojo

    #+begin_src c
    void eval_jojo(jo* array) {
      rs_push(array);
      eval();
    }
    #+end_src

* *stack_operation*

*** p_drop

    #+begin_src c
    void p_drop() {
      // (a ->)
      as_pop();
    }
    #+end_src

*** p_dup

    #+begin_src c
    void p_dup() {
      // (a a -> a)
      cell a = as_pop();
      as_push(a);
      as_push(a);
    }
    #+end_src

*** p_over

    #+begin_src c
    void p_over() {
      // (a b -> a b a)
      cell b = as_pop();
      cell a = as_pop();
      as_push(a);
      as_push(b);
      as_push(a);
    }
    #+end_src

*** p_tuck

    #+begin_src c
    void p_tuck() {
      // (a b -> b a b)
      cell b = as_pop();
      cell a = as_pop();
      as_push(b);
      as_push(a);
      as_push(b);
    }
    #+end_src

