jojo.html

<div id="outline-container-org1ebc709" class="outline-2">
<h2 id="org1ebc709">defprim</h2>
<div class="outline-text-2" id="text-org1ebc709">
</div><div id="outline-container-org16bf76c" class="outline-3">
<h3 id="org16bf76c">defprim_record</h3>
<div class="outline-text-3" id="text-org16bf76c">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">defprim_record</span>[64 * 1024];
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">defprim_record_counter</span> = 0;
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f139de" class="outline-3">
<h3 id="org5f139de">defprim_report</h3>
<div class="outline-text-3" id="text-org5f139de">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">defprim_report</span>() {
  printf(<span style="color: #e6db74;">"- defprim_report :\n"</span>);
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">i</span> = 0;
  <span style="color: #f92672; font-weight: bold;">while</span> (i &lt; defprim_record_counter) {
    printf(<span style="color: #e6db74;">"  %s\n"</span>, jo2str(defprim_record[i]));
    i++;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ac7e7a" class="outline-3">
<h3 id="org3ac7e7a">defprim</h3>
<div class="outline-text-3" id="text-org3ac7e7a">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">defprim</span>(<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">str</span>, <span style="color: #66d9ef; font-weight: bold;">primitive</span> <span style="color: #fd971f;">fun</span>) {
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">index</span> = str2jo(str);
  defprim_record[defprim_record_counter] = index;
  defprim_record_counter++;
  defprim_record[defprim_record_counter] = 0;
  jotable_set_primitive(index, fun);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3e4dcb2" class="outline-2">
<h2 id="org3e4dcb2">as &amp; rs</h2>
<div class="outline-text-2" id="text-org3e4dcb2">
</div><div id="outline-container-orgce3308c" class="outline-3">
<h3 id="orgce3308c">as</h3>
<div class="outline-text-3" id="text-orgce3308c">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #66d9ef; font-weight: bold;">argument_stack</span>[1024 * 4];

<span style="color: #66d9ef; font-weight: bold;">argument_stack</span> <span style="color: #fd971f;">as</span>;
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">as_base</span> = 64;
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">as_pointer</span> = 64;

<span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">as_push</span>(<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">value</span>) {
  as[as_pointer] = value;
  as_pointer++;
}

<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #a6e22e;">as_pop</span>() {
  as_pointer--;
  <span style="color: #f92672; font-weight: bold;">return</span> as[as_pointer];
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4badc7" class="outline-3">
<h3 id="orgb4badc7">rs</h3>
<div class="outline-text-3" id="text-orgb4badc7">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #66d9ef; font-weight: bold;">return_stack</span>[1024 * 4];

<span style="color: #66d9ef; font-weight: bold;">return_stack</span> <span style="color: #fd971f;">rs</span>;
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">rs_base</span> = 64;
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">rs_pointer</span> = 64;

<span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">rs_push</span>(<span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #fd971f;">value</span>) {
  rs[rs_pointer] = value;
  rs_pointer++;
}

<span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #a6e22e;">rs_pop</span>() {
  rs_pointer--;
  <span style="color: #f92672; font-weight: bold;">return</span> rs[rs_pointer];
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf832597" class="outline-2">
<h2 id="orgf832597">apply</h2>
<div class="outline-text-2" id="text-orgf832597">
</div><div id="outline-container-org4901fbe" class="outline-3">
<h3 id="org4901fbe">apply</h3>
<div class="outline-text-3" id="text-org4901fbe">
<ul class="org-ul">
<li><p>be careful when calling this function in primitive</p><p>because after rs_push a jojo</p><p>one need to exit current primitive to run the jojo</p></li></ul>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">apply</span>(<span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">jo</span>) {
  <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #960050;">!</span>jotable_entry_used(jotable[jo])) {
    printf(<span style="color: #e6db74;">"undefined jo : %s\n"</span>, jo2str(jo));
    <span style="color: #f92672; font-weight: bold;">return</span>;
  }
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">jo_type</span> = jotable[jo].type;
  <span style="color: #f92672; font-weight: bold;">if</span> (jo_type == str2jo(<span style="color: #e6db74;">"primitive"</span>)) {
    <span style="color: #66d9ef; font-weight: bold;">primitive</span> <span style="color: #fd971f;">primitive</span> = jotable_get_primitive(jo);
    primitive();
  }
  <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (jo_type == str2jo(<span style="color: #e6db74;">"jojo"</span>)) {
    <span style="color: #66d9ef; font-weight: bold;">jojo</span> <span style="color: #fd971f;">jojo</span> = jotable_get_jojo(jo);
    rs_push(jojo.array);
  }
  <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (jo_type == str2jo(<span style="color: #e6db74;">"cell"</span>)) {
    <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">cell</span> = jotable_get_cell(jo);
    as_push(cell);
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org28831e2" class="outline-3">
<h3 id="org28831e2">p_apply</h3>
<div class="outline-text-3" id="text-org28831e2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_apply</span>() {
  apply(as_pop());
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6bd566f" class="outline-2">
<h2 id="org6bd566f">eval</h2>
<div class="outline-text-2" id="text-org6bd566f">
</div><div id="outline-container-org95163bc" class="outline-3">
<h3 id="org95163bc">eval</h3>
<div class="outline-text-3" id="text-org95163bc">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">jmp_buf</span> <span style="color: #fd971f;">jmp_buffer</span>;

<span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">exit_eval</span>() {
  longjmp(jmp_buffer, 666);
}

<span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">eval</span>() {
  <span style="color: #f92672; font-weight: bold;">if</span> (666 == setjmp(jmp_buffer)) {
    <span style="color: #f92672; font-weight: bold;">return</span>;
  }
  <span style="color: #f92672; font-weight: bold;">else</span> {
    <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">rs_base</span> = rs_pointer;
    <span style="color: #f92672; font-weight: bold;">while</span> (rs_pointer &gt;= rs_base) {
      <span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #fd971f;">function_body</span> = rs_pop();
      rs_push(function_body + 1);
      <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">jo</span> = *(<span style="color: #66d9ef; font-weight: bold;">cell</span>*)function_body;
      apply(jo);
    }
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge03a46e" class="outline-3">
<h3 id="orge03a46e">eval_jo</h3>
<div class="outline-text-3" id="text-orge03a46e">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">eval_jo</span>(<span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">jo</span>) {
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">jo_type</span> = jotable[jo].type;
  <span style="color: #f92672; font-weight: bold;">if</span> (jo_type == str2jo(<span style="color: #e6db74;">"primitive"</span>)) {
    <span style="color: #66d9ef; font-weight: bold;">primitive</span> <span style="color: #fd971f;">primitive</span> = jotable_get_primitive(jo);
    primitive();
  }
  <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (jo_type == str2jo(<span style="color: #e6db74;">"jojo"</span>)) {
    <span style="color: #66d9ef; font-weight: bold;">jojo</span> <span style="color: #fd971f;">jojo</span> = jotable_get_jojo(jo);
    rs_push(jojo.array);
    eval();
  }
  <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (jo_type == str2jo(<span style="color: #e6db74;">"cell"</span>)) {
    <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">cell</span> = jotable_get_cell(jo);
    as_push(cell);
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org35b5ca6" class="outline-3">
<h3 id="org35b5ca6">eval_key</h3>
<div class="outline-text-3" id="text-org35b5ca6">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">eval_key</span>(<span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">jo</span>) {
  <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #960050;">!</span>jotable_entry_used(jotable[jo])) {
    printf(<span style="color: #e6db74;">"undefined keyword : %s\n"</span>, jo2str(jo));
    k_ignore();
    <span style="color: #f92672; font-weight: bold;">return</span>;
  }
  eval_jo(jo);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgffa7cf3" class="outline-3">
<h3 id="orgffa7cf3">eval_jojo</h3>
<div class="outline-text-3" id="text-orgffa7cf3">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">eval_jojo</span>(<span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #fd971f;">array</span>) {
  rs_push(array);
  eval();
}
</pre>
</div>
</div>
</div>
</div>
