jojo.org
*** p_swap

    #+begin_src c
    void p_swap() {
      // (a b -> b a)
      cell b = as_pop();
      cell a = as_pop();
      as_push(b);
      as_push(a);
    }
    #+end_src

*** p_print_stack

    #+begin_src c
    void p_print_stack() {
      // ([io] ->)
      printf("\n");
      if (as_pointer < as_base) {
        printf("  * %ld *  ", (as_pointer - as_base));
        printf("-- below the stack --\n");
      }
      else {
        printf("  * %ld *  ", (as_pointer - as_base));
        printf("-- ");
        cell i = as_base;
        while (i < as_pointer) {
          printf("%ld ", as[i]);
          i++;
        }
        printf("--\n");
      }
    }
    #+end_src

*** p_stack_base

    #+begin_src c
    void p_stack_base() {
      as_push(as + as_base);
    }
    #+end_src

*** p_stack_pointer

    #+begin_src c
    void p_stack_pointer() {
      as_push(as + as_pointer);
    }
    #+end_src

*** export_stack_operation

    #+begin_src c
    void export_stack_operation() {
      defprim("drop", p_drop);
      defprim("dup", p_dup);
      defprim("over", p_over);
      defprim("tuck", p_tuck);
      defprim("swap", p_swap);
      defprim("print-stack", p_print_stack);
      defprim("stack-pointer", p_stack_pointer);
      defprim("stack-base", p_stack_base);
    }
    #+end_src

* *ending*

*** p_end

    #+begin_src c
    void p_end() {
      // (rs: addr ->)
      rs_pop();
    }
    #+end_src

*** p_bye

    #+begin_src c
    void p_bye() {
      // (-> [exit])
      printf("bye bye ^-^/\n");
      exit_eval();
    }
    #+end_src

*** export_ending

    #+begin_src c
    void export_ending() {
      defprim("end", p_end);
      defprim("bye", p_bye);
    }
    #+end_src

* *control*

*** p_jump_back

    #+begin_src c
    void p_jump_back() {
      // (offset -> [rs])
      jo* function_body = rs_pop();
      rs_push(function_body - as_pop());
    }
    #+end_src

*** p_jump_over

    #+begin_src c
    void p_jump_over() {
      // (offset -> [rs])
      jo* function_body = rs_pop();
      rs_push(function_body + as_pop());
    }
    #+end_src

*** i_lit

    #+begin_src c
    void i_lit() {
      // ([rs] -> int)
      jo* function_body = rs_pop();
      rs_push(function_body + 1);
      cell jo = *(cell*)function_body;
      as_push(jo);
    }
    #+end_src

*** i_tail_call

    #+begin_src c
    void i_tail_call() {
      // ([rs] -> int)
      jo* function_body = rs_pop();
      cell jo = *(cell*)function_body;
      apply(jo);
    }
    #+end_src

*** p_jump_if_false

    #+begin_src c
    void p_jump_if_false() {
      // (bool addr -> [rs])
      jo* a = as_pop();
      cell b = as_pop();
      if (b == 0) {
        rs_pop();
        rs_push(a);
      }
    }
    #+end_src

*** export_control

    #+begin_src c
    void export_control() {
      defprim("jump-back", p_jump_back);
      defprim("jump-over", p_jump_over);
      defprim("i-lit", i_lit);
      defprim("i-tail-call", i_tail_call);
      defprim("jump-if-false", p_jump_if_false);
    }
    #+end_src

* *bool*

*** p_true

    #+begin_src c
    void p_true() {
      as_push(1);
    }
    #+end_src

*** p_false

    #+begin_src c
    void p_false() {
      as_push(0);
    }
    #+end_src

*** p_not

    #+begin_src c
    void p_not() {
      // (bool -> bool)
      cell a = as_pop();
      as_push(!a);
    }
    #+end_src

