jojo.html

<div id="outline-container-org1f40465" class="outline-2">
<h2 id="org1f40465"><b>stack_operation</b></h2>
<div class="outline-text-2" id="text-org1f40465">
</div><div id="outline-container-orgd48faee" class="outline-3">
<h3 id="orgd48faee">p_drop</h3>
<div class="outline-text-3" id="text-orgd48faee">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_drop</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(a -&gt;)</span>
  as_pop();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd14e388" class="outline-3">
<h3 id="orgd14e388">p_dup</h3>
<div class="outline-text-3" id="text-orgd14e388">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_dup</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(a a -&gt; a)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(a);
  as_push(a);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org35af9bc" class="outline-3">
<h3 id="org35af9bc">p_over</h3>
<div class="outline-text-3" id="text-org35af9bc">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_over</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(a b -&gt; a b a)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(a);
  as_push(b);
  as_push(a);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfef7d0b" class="outline-3">
<h3 id="orgfef7d0b">p_tuck</h3>
<div class="outline-text-3" id="text-orgfef7d0b">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_tuck</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(a b -&gt; b a b)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(b);
  as_push(a);
  as_push(b);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ad521b" class="outline-3">
<h3 id="org4ad521b">p_swap</h3>
<div class="outline-text-3" id="text-org4ad521b">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_swap</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(a b -&gt; b a)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(b);
  as_push(a);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org91da7f4" class="outline-3">
<h3 id="org91da7f4">p_print_stack</h3>
<div class="outline-text-3" id="text-org91da7f4">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_print_stack</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt;)</span>
  printf(<span style="color: #e6db74;">"\n"</span>);
  <span style="color: #f92672; font-weight: bold;">if</span> (as_pointer &lt; as_base) {
    printf(<span style="color: #e6db74;">"  * %ld *  "</span>, (as_pointer - as_base));
    printf(<span style="color: #e6db74;">"-- below the stack --\n"</span>);
  }
  <span style="color: #f92672; font-weight: bold;">else</span> {
    printf(<span style="color: #e6db74;">"  * %ld *  "</span>, (as_pointer - as_base));
    printf(<span style="color: #e6db74;">"-- "</span>);
    <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">i</span> = as_base;
    <span style="color: #f92672; font-weight: bold;">while</span> (i &lt; as_pointer) {
      printf(<span style="color: #e6db74;">"%ld "</span>, as[i]);
      i++;
    }
    printf(<span style="color: #e6db74;">"--\n"</span>);
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org62962ac" class="outline-3">
<h3 id="org62962ac">p_stack_base</h3>
<div class="outline-text-3" id="text-org62962ac">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_stack_base</span>() {
  as_push(as + as_base);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org77ed7a6" class="outline-3">
<h3 id="org77ed7a6">p_stack_pointer</h3>
<div class="outline-text-3" id="text-org77ed7a6">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_stack_pointer</span>() {
  as_push(as + as_pointer);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ff778e" class="outline-3">
<h3 id="org4ff778e">export_stack_operation</h3>
<div class="outline-text-3" id="text-org4ff778e">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_stack_operation</span>() {
  defprim(<span style="color: #e6db74;">"drop"</span>, p_drop);
  defprim(<span style="color: #e6db74;">"dup"</span>, p_dup);
  defprim(<span style="color: #e6db74;">"over"</span>, p_over);
  defprim(<span style="color: #e6db74;">"tuck"</span>, p_tuck);
  defprim(<span style="color: #e6db74;">"swap"</span>, p_swap);
  defprim(<span style="color: #e6db74;">"print-stack"</span>, p_print_stack);
  defprim(<span style="color: #e6db74;">"stack-pointer"</span>, p_stack_pointer);
  defprim(<span style="color: #e6db74;">"stack-base"</span>, p_stack_base);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf9847d2" class="outline-2">
<h2 id="orgf9847d2"><b>ending</b></h2>
<div class="outline-text-2" id="text-orgf9847d2">
</div><div id="outline-container-org4af6c93" class="outline-3">
<h3 id="org4af6c93">p_end</h3>
<div class="outline-text-3" id="text-org4af6c93">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_end</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(rs: addr -&gt;)</span>
  rs_pop();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga5576b" class="outline-3">
<h3 id="orga5576b">p_bye</h3>
<div class="outline-text-3" id="text-orga5576b">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_bye</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(-&gt; [exit])</span>
  printf(<span style="color: #e6db74;">"bye bye ^-^/\n"</span>);
  exit_eval();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa4fd9c" class="outline-3">
<h3 id="orgaa4fd9c">export_ending</h3>
<div class="outline-text-3" id="text-orgaa4fd9c">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_ending</span>() {
  defprim(<span style="color: #e6db74;">"end"</span>, p_end);
  defprim(<span style="color: #e6db74;">"bye"</span>, p_bye);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcc1c11e" class="outline-2">
<h2 id="orgcc1c11e"><b>control</b></h2>
<div class="outline-text-2" id="text-orgcc1c11e">
</div><div id="outline-container-orgf94ac5a" class="outline-3">
<h3 id="orgf94ac5a">p_jump_back</h3>
<div class="outline-text-3" id="text-orgf94ac5a">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_jump_back</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(offset -&gt; [rs])</span>
  <span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #fd971f;">function_body</span> = rs_pop();
  rs_push(function_body - as_pop());
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a4d6ad" class="outline-3">
<h3 id="org3a4d6ad">p_jump_over</h3>
<div class="outline-text-3" id="text-org3a4d6ad">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_jump_over</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(offset -&gt; [rs])</span>
  <span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #fd971f;">function_body</span> = rs_pop();
  rs_push(function_body + as_pop());
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6c5cba" class="outline-3">
<h3 id="orgd6c5cba">i_lit</h3>
<div class="outline-text-3" id="text-orgd6c5cba">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">i_lit</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([rs] -&gt; int)</span>
  <span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #fd971f;">function_body</span> = rs_pop();
  rs_push(function_body + 1);
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">jo</span> = *(<span style="color: #66d9ef; font-weight: bold;">cell</span>*)function_body;
  as_push(jo);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2d74113" class="outline-3">
<h3 id="org2d74113">i_tail_call</h3>
<div class="outline-text-3" id="text-org2d74113">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">i_tail_call</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([rs] -&gt; int)</span>
  <span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #fd971f;">function_body</span> = rs_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">jo</span> = *(<span style="color: #66d9ef; font-weight: bold;">cell</span>*)function_body;
  apply(jo);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee7ac70" class="outline-3">
<h3 id="orgee7ac70">p_jump_if_false</h3>
<div class="outline-text-3" id="text-orgee7ac70">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_jump_if_false</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(bool addr -&gt; [rs])</span>
  <span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #fd971f;">a</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span> = as_pop();
  <span style="color: #f92672; font-weight: bold;">if</span> (b == 0) {
    rs_pop();
    rs_push(a);
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d07e5b" class="outline-3">
<h3 id="org3d07e5b">export_control</h3>
<div class="outline-text-3" id="text-org3d07e5b">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_control</span>() {
  defprim(<span style="color: #e6db74;">"jump-back"</span>, p_jump_back);
  defprim(<span style="color: #e6db74;">"jump-over"</span>, p_jump_over);
  defprim(<span style="color: #e6db74;">"i-lit"</span>, i_lit);
  defprim(<span style="color: #e6db74;">"i-tail-call"</span>, i_tail_call);
  defprim(<span style="color: #e6db74;">"jump-if-false"</span>, p_jump_if_false);
}
</pre>
</div>
</div>
</div>
</div>
