jojo.org
*** export_bool

    #+begin_src c
    void export_bool() {
      defprim("true", p_true);
      defprim("false", p_false);
      defprim("not", p_not);
    }
    #+end_src

* *integer*

*** p_add

    #+begin_src c
    void p_add() {
      // (cell cell -> int)
      cell b = as_pop();
      cell a = as_pop();
      as_push(a + b);
    }
    #+end_src

*** p_sub

    #+begin_src c
    void p_sub() {
      // (cell cell -> int)
      cell b = as_pop();
      cell a = as_pop();
      as_push(a - b);
    }
    #+end_src

*** p_mul

    #+begin_src c
    void p_mul() {
      // (cell cell -> int)
      cell b = as_pop();
      cell a = as_pop();
      as_push(a * b);
    }
    #+end_src

*** p_div

    #+begin_src c
    void p_div() {
      // (cell cell -> int)
      cell b = as_pop();
      cell a = as_pop();
      as_push(a / b);
    }
    #+end_src

*** p_mod

    #+begin_src c
    void p_mod() {
      // (cell cell -> int)
      cell b = as_pop();
      cell a = as_pop();
      as_push(a % b);
    }
    #+end_src

*** p_eq_p

    #+begin_src c
    void p_eq_p() {
      // (cell cell -> bool)
      cell b = as_pop();
      cell a = as_pop();
      as_push(a == b);
    }
    #+end_src

*** p_gt_p

    #+begin_src c
    void p_gt_p() {
      // (cell cell -> bool)
      cell b = as_pop();
      cell a = as_pop();
      as_push(a > b);
    }
    #+end_src

*** p_lt_p

    #+begin_src c
    void p_lt_p() {
      // (cell cell -> bool)
      cell b = as_pop();
      cell a = as_pop();
      as_push(a < b);
    }
    #+end_src

*** p_gteq_p

    #+begin_src c
    void p_gteq_p() {
      // (cell cell -> bool)
      cell b = as_pop();
      cell a = as_pop();
      as_push(a >= b);
    }
    #+end_src

*** p_lteq_p

    #+begin_src c
    void p_lteq_p() {
      // (cell cell -> bool)
      cell b = as_pop();
      cell a = as_pop();
      as_push(a <= b);
    }
    #+end_src

*** k_integer

    #+begin_src c
    jo read_jo();

    void k_integer() {
      // ([io] -> [compile])
      while (true) {
        jo s = read_jo();
        if (s == str2jo(")")) {
          break;
        }
        else if (int_string_p(jo2str(s))) {
          here(str2jo("i-lit"));
          here(atoi(jo2str(s)));
        }
        else {
          printf("meet non-cell string in (# ...) : %s", jo2str(s));
          break;
        }
      }
    }
    #+end_src

*** p_print_integer

    #+begin_src c
    void p_print_integer() {
      // (cell -> [io])
      printf("%ld", as_pop());
    }
    #+end_src

*** p_dot

    #+begin_src c
    void p_dot() {
      // (cell -> [io])
      printf("%ld ", as_pop());
    }
    #+end_src

*** export_integer

    #+begin_src c
    void export_integer() {
      defprim("add", p_add);
      defprim("sub", p_sub);

      defprim("mul", p_mul);
      defprim("div", p_div);
      defprim("mod", p_mod);

      defprim("neg", p_not);

      defprim("eq?", p_eq_p);
      defprim("gt?", p_gt_p);
      defprim("lt?", p_lt_p);
      defprim("gteq?", p_gteq_p);
      defprim("lteq?", p_lteq_p);

      defprim("#", k_integer);

      defprim("print-integer", p_print_integer);
      defprim("dot", p_dot);
    }
    #+end_src

* *memory*

