jojo.html

<div id="outline-container-orgdb2e63c" class="outline-2">
<h2 id="orgdb2e63c"><b>bool</b></h2>
<div class="outline-text-2" id="text-orgdb2e63c">
</div><div id="outline-container-orgb0cd12d" class="outline-3">
<h3 id="orgb0cd12d">p_true</h3>
<div class="outline-text-3" id="text-orgb0cd12d">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_true</span>() {
  as_push(1);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org57dda4b" class="outline-3">
<h3 id="org57dda4b">p_false</h3>
<div class="outline-text-3" id="text-org57dda4b">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_false</span>() {
  as_push(0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7de8bd9" class="outline-3">
<h3 id="org7de8bd9">p_not</h3>
<div class="outline-text-3" id="text-org7de8bd9">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_not</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(bool -&gt; bool)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(<span style="color: #960050;">!</span>a);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee62f8e" class="outline-3">
<h3 id="orgee62f8e">export_bool</h3>
<div class="outline-text-3" id="text-orgee62f8e">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_bool</span>() {
  defprim(<span style="color: #e6db74;">"true"</span>, p_true);
  defprim(<span style="color: #e6db74;">"false"</span>, p_false);
  defprim(<span style="color: #e6db74;">"not"</span>, p_not);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1e714f0" class="outline-2">
<h2 id="org1e714f0"><b>integer</b></h2>
<div class="outline-text-2" id="text-org1e714f0">
</div><div id="outline-container-orged20755" class="outline-3">
<h3 id="orged20755">p_add</h3>
<div class="outline-text-3" id="text-orged20755">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_add</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(cell cell -&gt; int)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(a + b);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org943604a" class="outline-3">
<h3 id="org943604a">p_sub</h3>
<div class="outline-text-3" id="text-org943604a">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_sub</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(cell cell -&gt; int)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(a - b);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a14892" class="outline-3">
<h3 id="org3a14892">p_mul</h3>
<div class="outline-text-3" id="text-org3a14892">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_mul</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(cell cell -&gt; int)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(a * b);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ec4764" class="outline-3">
<h3 id="org7ec4764">p_div</h3>
<div class="outline-text-3" id="text-org7ec4764">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_div</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(cell cell -&gt; int)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(a / b);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga9912a3" class="outline-3">
<h3 id="orga9912a3">p_mod</h3>
<div class="outline-text-3" id="text-orga9912a3">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_mod</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(cell cell -&gt; int)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(a % b);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d7c2bb" class="outline-3">
<h3 id="org1d7c2bb">p_eq_p</h3>
<div class="outline-text-3" id="text-org1d7c2bb">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_eq_p</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(cell cell -&gt; bool)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(a == b);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc36fcc4" class="outline-3">
<h3 id="orgc36fcc4">p_gt_p</h3>
<div class="outline-text-3" id="text-orgc36fcc4">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_gt_p</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(cell cell -&gt; bool)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(a &gt; b);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgde491eb" class="outline-3">
<h3 id="orgde491eb">p_lt_p</h3>
<div class="outline-text-3" id="text-orgde491eb">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_lt_p</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(cell cell -&gt; bool)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(a &lt; b);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org54ab125" class="outline-3">
<h3 id="org54ab125">p_gteq_p</h3>
<div class="outline-text-3" id="text-org54ab125">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_gteq_p</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(cell cell -&gt; bool)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(a &gt;= b);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc58d4d0" class="outline-3">
<h3 id="orgc58d4d0">p_lteq_p</h3>
<div class="outline-text-3" id="text-orgc58d4d0">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_lteq_p</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(cell cell -&gt; bool)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">b</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">a</span> = as_pop();
  as_push(a &lt;= b);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9106618" class="outline-3">
<h3 id="org9106618">k_integer</h3>
<div class="outline-text-3" id="text-org9106618">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #a6e22e;">read_jo</span>();

<span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_integer</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [compile])</span>
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">s</span> = read_jo();
    <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">")"</span>)) {
      <span style="color: #f92672; font-weight: bold;">break</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (int_string_p(jo2str(s))) {
      here(str2jo(<span style="color: #e6db74;">"i-lit"</span>));
      here(atoi(jo2str(s)));
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      printf(<span style="color: #e6db74;">"meet non-cell string in (# ...) : %s"</span>, jo2str(s));
      <span style="color: #f92672; font-weight: bold;">break</span>;
    }
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org389996" class="outline-3">
<h3 id="org389996">p_print_integer</h3>
<div class="outline-text-3" id="text-org389996">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_print_integer</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(cell -&gt; [io])</span>
  printf(<span style="color: #e6db74;">"%ld"</span>, as_pop());
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org167cdb9" class="outline-3">
<h3 id="org167cdb9">p_dot</h3>
<div class="outline-text-3" id="text-org167cdb9">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_dot</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(cell -&gt; [io])</span>
  printf(<span style="color: #e6db74;">"%ld "</span>, as_pop());
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3fdce26" class="outline-3">
<h3 id="org3fdce26">export_integer</h3>
<div class="outline-text-3" id="text-org3fdce26">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_integer</span>() {
  defprim(<span style="color: #e6db74;">"add"</span>, p_add);
  defprim(<span style="color: #e6db74;">"sub"</span>, p_sub);

  defprim(<span style="color: #e6db74;">"mul"</span>, p_mul);
  defprim(<span style="color: #e6db74;">"div"</span>, p_div);
  defprim(<span style="color: #e6db74;">"mod"</span>, p_mod);

  defprim(<span style="color: #e6db74;">"neg"</span>, p_not);

  defprim(<span style="color: #e6db74;">"eq?"</span>, p_eq_p);
  defprim(<span style="color: #e6db74;">"gt?"</span>, p_gt_p);
  defprim(<span style="color: #e6db74;">"lt?"</span>, p_lt_p);
  defprim(<span style="color: #e6db74;">"gteq?"</span>, p_gteq_p);
  defprim(<span style="color: #e6db74;">"lteq?"</span>, p_lteq_p);

  defprim(<span style="color: #e6db74;">"#"</span>, k_integer);

  defprim(<span style="color: #e6db74;">"print-integer"</span>, p_print_integer);
  defprim(<span style="color: #e6db74;">"dot"</span>, p_dot);
}
</pre>
</div>
</div>
</div>
</div>
