jojo.org
*** p_allocate

    #+begin_src c
    void p_allocate () {
      // (size -> addr)
      as_push(calloc(as_pop(), 1));
    }
    #+end_src

*** p_free

    #+begin_src c
    void p_free () {
      // (addr ->)
      free(as_pop());
    }
    #+end_src

*** k_var

    #+begin_src c
    void k_var() {
      // ([io] -> [compile])
      here(str2jo("i-lit"));
      jo index = read_jo();
      here(&(jotable[index].value.cell));
      k_ignore();
    }
    #+end_src

*** p_set

    #+begin_src c
    void p_set() {
      // (cell addr ->)
      cell* address = as_pop();
      cell value = as_pop();
      address[0] = value;
    }
    #+end_src

*** p_get

    #+begin_src c
    void p_get() {
      // (addr -> cell)
      cell* address = as_pop();
      as_push(address[0]);
    }
    #+end_src

*** export_memory

    #+begin_src c
    void export_memory() {
      defprim("allocate", p_allocate);
      defprim("free", p_free);
      defprim("var", k_var);
      defprim("set", p_set);
      defprim("get", p_get);
    }
    #+end_src

* read_char

*** reading_stack

    #+begin_src c
    typedef FILE* reading_stack_t[64];

    reading_stack_t reading_stack;
    cell reading_stack_base = 0;
    cell reading_stack_pointer = 0;

    void reading_stack_push(FILE* value) {
      reading_stack[reading_stack_pointer] = value;
      reading_stack_pointer++;
    }

    FILE* reading_stack_pop() {
      reading_stack_pointer--;
      return reading_stack[reading_stack_pointer];
    }

    FILE* reading_stack_tos() {
      return reading_stack[reading_stack_pointer - 1];
    }

    bool reading_stack_empty_p() {
      return reading_stack_pointer == reading_stack_base;
    }
    #+end_src

*** loading_stack

    - a hook for read_jo

    #+begin_src c
    typedef struct {
      jo nick;
      jo name;
    } alias;

    typedef alias* loading_stack_t[64];

    loading_stack_t loading_stack;
    cell loading_stack_base = 0;
    cell loading_stack_pointer = 0;

    void loading_stack_push(alias* value) {
      loading_stack[loading_stack_pointer] = value;
      loading_stack_pointer++;
    }

    alias* loading_stack_pop() {
      loading_stack_pointer--;
      return loading_stack[loading_stack_pointer];
    }

    alias* loading_stack_tos() {
      return loading_stack[loading_stack_pointer - 1];
    }

    bool loading_stack_empty_p() {
      return loading_stack_pointer == loading_stack_base;
    }

    cell alias_record_size = 1024;

    void init_loading_stack() {
      alias record[alias_record_size];
      alias a = {.nick = 0, .name = 0};
      record[0] = a;
      loading_stack_push(record);
    }
    #+end_src

*** read_char

    #+begin_src c
    char read_char() {
      if (reading_stack_empty_p()) {
        return fgetc(stdin);
      }
      else {
        char c = fgetc(reading_stack_tos());
        if (c == EOF) {
          fclose(reading_stack_pop());
          loading_stack_pop();
          return read_char();
        }
        else {
          return c;
        }
      }
    }
    #+end_src

*** unread_char

    #+begin_src c
    void unread_char(char c) {
      if (reading_stack_empty_p()) {
        ungetc(c, stdin);
      }
      else {
        ungetc(c, reading_stack_tos());
      }
    }
    #+end_src

* *jo*

*** alias_add

    #+begin_src c
    void alias_add(jo nick, jo name) {
      alias* alias_record = loading_stack_tos();
      cell i = 0;
      while (i < alias_record_size) {
        if (alias_record[i].nick == 0 &&
            alias_record[i].name == 0) {
          alias_record[i].nick = nick;
          alias_record[i].name = name;
          alias_record[i+1].nick = 0;
          alias_record[i+1].name = 0;
          return;
        }
        else {
          i++;
        }
      }
      printf("alias_add fail alias_record is full\n");
    }
    #+end_src

