jojo.html

<div id="outline-container-orge02c22b" class="outline-2">
<h2 id="orge02c22b"><b>memory</b></h2>
<div class="outline-text-2" id="text-orge02c22b">
</div><div id="outline-container-org8539f4f" class="outline-3">
<h3 id="org8539f4f">p_allocate</h3>
<div class="outline-text-3" id="text-org8539f4f">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_allocate</span> () {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(size -&gt; addr)</span>
  as_push(calloc(as_pop(), 1));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org11ba61e" class="outline-3">
<h3 id="org11ba61e">p_free</h3>
<div class="outline-text-3" id="text-org11ba61e">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_free</span> () {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(addr -&gt;)</span>
  free(as_pop());
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org848381d" class="outline-3">
<h3 id="org848381d">k_var</h3>
<div class="outline-text-3" id="text-org848381d">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_var</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [compile])</span>
  here(str2jo(<span style="color: #e6db74;">"i-lit"</span>));
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">index</span> = read_jo();
  here(&amp;(jotable[index].value.cell));
  k_ignore();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org27093bd" class="outline-3">
<h3 id="org27093bd">p_set</h3>
<div class="outline-text-3" id="text-org27093bd">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_set</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(cell addr -&gt;)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span>* <span style="color: #fd971f;">address</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">value</span> = as_pop();
  address[0] = value;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ead89d" class="outline-3">
<h3 id="org2ead89d">p_get</h3>
<div class="outline-text-3" id="text-org2ead89d">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_get</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(addr -&gt; cell)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span>* <span style="color: #fd971f;">address</span> = as_pop();
  as_push(address[0]);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc8cc5ef" class="outline-3">
<h3 id="orgc8cc5ef">export_memory</h3>
<div class="outline-text-3" id="text-orgc8cc5ef">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_memory</span>() {
  defprim(<span style="color: #e6db74;">"allocate"</span>, p_allocate);
  defprim(<span style="color: #e6db74;">"free"</span>, p_free);
  defprim(<span style="color: #e6db74;">"var"</span>, k_var);
  defprim(<span style="color: #e6db74;">"set"</span>, p_set);
  defprim(<span style="color: #e6db74;">"get"</span>, p_get);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4670674" class="outline-2">
<h2 id="org4670674">read_char</h2>
<div class="outline-text-2" id="text-org4670674">
</div><div id="outline-container-orgedfef01" class="outline-3">
<h3 id="orgedfef01">reading_stack</h3>
<div class="outline-text-3" id="text-orgedfef01">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #66d9ef; font-weight: bold;">FILE</span>* <span style="color: #66d9ef; font-weight: bold;">reading_stack_t</span>[64];

<span style="color: #66d9ef; font-weight: bold;">reading_stack_t</span> <span style="color: #fd971f;">reading_stack</span>;
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">reading_stack_base</span> = 0;
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">reading_stack_pointer</span> = 0;

<span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">reading_stack_push</span>(<span style="color: #66d9ef; font-weight: bold;">FILE</span>* <span style="color: #fd971f;">value</span>) {
  reading_stack[reading_stack_pointer] = value;
  reading_stack_pointer++;
}

<span style="color: #66d9ef; font-weight: bold;">FILE</span>* <span style="color: #a6e22e;">reading_stack_pop</span>() {
  reading_stack_pointer--;
  <span style="color: #f92672; font-weight: bold;">return</span> reading_stack[reading_stack_pointer];
}

<span style="color: #66d9ef; font-weight: bold;">FILE</span>* <span style="color: #a6e22e;">reading_stack_tos</span>() {
  <span style="color: #f92672; font-weight: bold;">return</span> reading_stack[reading_stack_pointer - 1];
}

<span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">reading_stack_empty_p</span>() {
  <span style="color: #f92672; font-weight: bold;">return</span> reading_stack_pointer == reading_stack_base;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb242deb" class="outline-3">
<h3 id="orgb242deb">loading_stack</h3>
<div class="outline-text-3" id="text-orgb242deb">
<ul class="org-ul">
<li><p>a hook for read_jo</p></li></ul>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #f92672; font-weight: bold;">struct</span> {
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">nick</span>;
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">name</span>;
} <span style="color: #66d9ef; font-weight: bold;">alias</span>;

<span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #66d9ef; font-weight: bold;">alias</span>* <span style="color: #66d9ef; font-weight: bold;">loading_stack_t</span>[64];

<span style="color: #66d9ef; font-weight: bold;">loading_stack_t</span> <span style="color: #fd971f;">loading_stack</span>;
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">loading_stack_base</span> = 0;
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">loading_stack_pointer</span> = 0;

<span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">loading_stack_push</span>(<span style="color: #66d9ef; font-weight: bold;">alias</span>* <span style="color: #fd971f;">value</span>) {
  loading_stack[loading_stack_pointer] = value;
  loading_stack_pointer++;
}

<span style="color: #66d9ef; font-weight: bold;">alias</span>* <span style="color: #a6e22e;">loading_stack_pop</span>() {
  loading_stack_pointer--;
  <span style="color: #f92672; font-weight: bold;">return</span> loading_stack[loading_stack_pointer];
}

<span style="color: #66d9ef; font-weight: bold;">alias</span>* <span style="color: #a6e22e;">loading_stack_tos</span>() {
  <span style="color: #f92672; font-weight: bold;">return</span> loading_stack[loading_stack_pointer - 1];
}

<span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">loading_stack_empty_p</span>() {
  <span style="color: #f92672; font-weight: bold;">return</span> loading_stack_pointer == loading_stack_base;
}

<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">alias_record_size</span> = 1024;

<span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">init_loading_stack</span>() {
  <span style="color: #66d9ef; font-weight: bold;">alias</span> <span style="color: #fd971f;">record</span>[alias_record_size];
  <span style="color: #66d9ef; font-weight: bold;">alias</span> <span style="color: #fd971f;">a</span> = {.nick = 0, .name = 0};
  record[0] = a;
  loading_stack_push(record);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc9e4dc" class="outline-3">
<h3 id="orgfc9e4dc">read_char</h3>
<div class="outline-text-3" id="text-orgfc9e4dc">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #a6e22e;">read_char</span>() {
  <span style="color: #f92672; font-weight: bold;">if</span> (reading_stack_empty_p()) {
    <span style="color: #f92672; font-weight: bold;">return</span> fgetc(stdin);
  }
  <span style="color: #f92672; font-weight: bold;">else</span> {
    <span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">c</span> = fgetc(reading_stack_tos());
    <span style="color: #f92672; font-weight: bold;">if</span> (c == EOF) {
      fclose(reading_stack_pop());
      loading_stack_pop();
      <span style="color: #f92672; font-weight: bold;">return</span> read_char();
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      <span style="color: #f92672; font-weight: bold;">return</span> c;
    }
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f9747d" class="outline-3">
<h3 id="org2f9747d">unread_char</h3>
<div class="outline-text-3" id="text-org2f9747d">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">unread_char</span>(<span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">c</span>) {
  <span style="color: #f92672; font-weight: bold;">if</span> (reading_stack_empty_p()) {
    ungetc(c, stdin);
  }
  <span style="color: #f92672; font-weight: bold;">else</span> {
    ungetc(c, reading_stack_tos());
  }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5c36558" class="outline-2">
<h2 id="org5c36558"><b>jo</b></h2>
<div class="outline-text-2" id="text-org5c36558">
</div><div id="outline-container-orgb8459c" class="outline-3">
<h3 id="orgb8459c">alias_add</h3>
<div class="outline-text-3" id="text-orgb8459c">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">alias_add</span>(<span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">nick</span>, <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">name</span>) {
  <span style="color: #66d9ef; font-weight: bold;">alias</span>* <span style="color: #fd971f;">alias_record</span> = loading_stack_tos();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">i</span> = 0;
  <span style="color: #f92672; font-weight: bold;">while</span> (i &lt; alias_record_size) {
    <span style="color: #f92672; font-weight: bold;">if</span> (alias_record[i].nick == 0 &amp;&amp;
        alias_record[i].name == 0) {
      alias_record[i].nick = nick;
      alias_record[i].name = name;
      alias_record[i+1].nick = 0;
      alias_record[i+1].name = 0;
      <span style="color: #f92672; font-weight: bold;">return</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      i++;
    }
  }
  printf(<span style="color: #e6db74;">"alias_add fail alias_record is full\n"</span>);
}
</pre>
</div>
</div>
</div>
