jojo.org
*** alias_find

    #+begin_src c
    jo alias_find(jo nick) {
      // return 0 -- not found
      alias* alias_record = loading_stack_tos();
      cell i = 0;
      while (true) {
        if (alias_record[i].nick == 0 &&
            alias_record[i].name == 0) {
          return 0;
        }
        else if (alias_record[i].nick == nick) {
          return alias_record[i].name;
        }
        else {
          i++;
        }
      }
    }
    #+end_src

*** read_jo

    #+begin_src c
    jo read_jo() {
      // ([io] -> jo)
      char buf[1024];
      cell cur = 0;
      cell collecting = false;
      char c;
      char go = true;
      while (go) {
        c = read_char();
        if (!collecting) {
          if (isspace(c)) {
            // do nothing
          }
          else {
            collecting = true;
            buf[cur] = c;
            cur++;
            if (isbarcket(c)) {
              go = false;
            }
          }
        }
        else {
          if (isbarcket(c) ||
              isspace(c)) {
            unread_char(c);
            go = false;
          }
          else {
            buf[cur] = c;
            cur++;
          }
        }
      }
      buf[cur] = 0;
      jo jo0 = str2jo(buf);
      jo jo1 = alias_find(jo0);
      if (jo1 != 0) {
        return jo1;
      }
      else {
        return jo0;
      }
    }
    #+end_src

*** cat_jo

    #+begin_src c
    jo cat_jo(jo x, jo y) {
      char str[1024];
      str[0] = 0;
      strcat(str, jo2str(x));
      strcat(str, jo2str(y));
      return str2jo(str);
    }
    #+end_src

*** p_read_jo

    #+begin_src c
    void p_read_jo() {
      as_push(read_jo());
    }
    #+end_src

*** p_jo_used_p

    #+begin_src c
    void p_jo_used_p() {
      // (jo -> bool)
      jo jo = as_pop();
      as_push(jotable_entry_used(jotable[jo]));
    }
    #+end_src

*** p_jo_to_string

    #+begin_src c
    void p_jo_to_string() {
      // (jo -> string)
      jo jo = as_pop();
      as_push(jo2str(jo));
    }
    #+end_src

*** export_jo

    #+begin_src c
    void export_jo() {
      defprim("read-jo", p_read_jo);
      defprim("jo-used?", p_jo_used_p);
      defprim("jo->string", p_jo_to_string);
    }
    #+end_src

* *string*

*** k_string

    #+begin_src c
    void k_string() {
      // ([io] -> [compile])
      while (true) {
        jo s = read_jo();
        if (s == str2jo(")")) {
          return;
        }
        else if (s == str2jo("(")) {
          k_one_string();
        }
        else {
          // do nothing
        }
      }
    }

    void k_one_string() {
      // ([io] -> [compile])
      char buffer[1024 * 1024];
      cell cursor = 0;
      while (true) {
        char c = read_char();
        if (c == ')') {
          buffer[cursor] = 0;
          cursor++;
          break;
        }
        else {
          buffer[cursor] = c;
          cursor++;
        }
      }
      string str = malloc(cursor);
      strcpy(str, buffer);
      here(str2jo("i-lit"));
      here(str);
    }
    #+end_src

*** p_print_string

    #+begin_src c
    void p_print_string() {
      // (string -> [io])
      printf("%s", as_pop());
    }
    #+end_src

*** export_string

    #+begin_src c
    void export_string() {
      defprim("string", k_string);
      defprim("print-string", p_print_string);
    }
    #+end_src

* *file*

