jojo.html

<div id="outline-container-orgc41508a" class="outline-3">
<h3 id="orgc41508a">alias_find</h3>
<div class="outline-text-3" id="text-orgc41508a">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #a6e22e;">alias_find</span>(<span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">nick</span>) {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">return 0 -- not found</span>
  <span style="color: #66d9ef; font-weight: bold;">alias</span>* <span style="color: #fd971f;">alias_record</span> = loading_stack_tos();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">i</span> = 0;
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #f92672; font-weight: bold;">if</span> (alias_record[i].nick == 0 &amp;&amp;
        alias_record[i].name == 0) {
      <span style="color: #f92672; font-weight: bold;">return</span> 0;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (alias_record[i].nick == nick) {
      <span style="color: #f92672; font-weight: bold;">return</span> alias_record[i].name;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      i++;
    }
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e64ecd" class="outline-3">
<h3 id="org1e64ecd">read_jo</h3>
<div class="outline-text-3" id="text-org1e64ecd">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #a6e22e;">read_jo</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; jo)</span>
  <span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">buf</span>[1024];
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">cur</span> = 0;
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">collecting</span> = <span style="color: #ae81ff;">false</span>;
  <span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">c</span>;
  <span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">go</span> = <span style="color: #ae81ff;">true</span>;
  <span style="color: #f92672; font-weight: bold;">while</span> (go) {
    c = read_char();
    <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #960050;">!</span>collecting) {
      <span style="color: #f92672; font-weight: bold;">if</span> (isspace(c)) {
        <span style="color: #FF8888;">// </span><span style="color: #FF8888;">do nothing</span>
      }
      <span style="color: #f92672; font-weight: bold;">else</span> {
        collecting = <span style="color: #ae81ff;">true</span>;
        buf[cur] = c;
        cur++;
        <span style="color: #f92672; font-weight: bold;">if</span> (isbarcket(c)) {
          go = <span style="color: #ae81ff;">false</span>;
        }
      }
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      <span style="color: #f92672; font-weight: bold;">if</span> (isbarcket(c) ||
          isspace(c)) {
        unread_char(c);
        go = <span style="color: #ae81ff;">false</span>;
      }
      <span style="color: #f92672; font-weight: bold;">else</span> {
        buf[cur] = c;
        cur++;
      }
    }
  }
  buf[cur] = 0;
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">jo0</span> = str2jo(buf);
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">jo1</span> = alias_find(jo0);
  <span style="color: #f92672; font-weight: bold;">if</span> (jo1 != 0) {
    <span style="color: #f92672; font-weight: bold;">return</span> jo1;
  }
  <span style="color: #f92672; font-weight: bold;">else</span> {
    <span style="color: #f92672; font-weight: bold;">return</span> jo0;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e374a7" class="outline-3">
<h3 id="org7e374a7">cat_jo</h3>
<div class="outline-text-3" id="text-org7e374a7">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #a6e22e;">cat_jo</span>(<span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">x</span>, <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">y</span>) {
  <span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">str</span>[1024];
  str[0] = 0;
  strcat(str, jo2str(x));
  strcat(str, jo2str(y));
  <span style="color: #f92672; font-weight: bold;">return</span> str2jo(str);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc10a5b" class="outline-3">
<h3 id="orgc10a5b">p_read_jo</h3>
<div class="outline-text-3" id="text-orgc10a5b">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_read_jo</span>() {
  as_push(read_jo());
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc486a94" class="outline-3">
<h3 id="orgc486a94">p_jo_used_p</h3>
<div class="outline-text-3" id="text-orgc486a94">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_jo_used_p</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(jo -&gt; bool)</span>
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">jo</span> = as_pop();
  as_push(jotable_entry_used(jotable[jo]));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b0cf9e" class="outline-3">
<h3 id="org5b0cf9e">p_jo_to_string</h3>
<div class="outline-text-3" id="text-org5b0cf9e">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_jo_to_string</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(jo -&gt; string)</span>
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">jo</span> = as_pop();
  as_push(jo2str(jo));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org686cedb" class="outline-3">
<h3 id="org686cedb">export_jo</h3>
<div class="outline-text-3" id="text-org686cedb">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_jo</span>() {
  defprim(<span style="color: #e6db74;">"read-jo"</span>, p_read_jo);
  defprim(<span style="color: #e6db74;">"jo-used?"</span>, p_jo_used_p);
  defprim(<span style="color: #e6db74;">"jo-&gt;string"</span>, p_jo_to_string);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org97c9502" class="outline-2">
<h2 id="org97c9502"><b>string</b></h2>
<div class="outline-text-2" id="text-org97c9502">
</div><div id="outline-container-org461e0dc" class="outline-3">
<h3 id="org461e0dc">k_string</h3>
<div class="outline-text-3" id="text-org461e0dc">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_string</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [compile])</span>
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">s</span> = read_jo();
    <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">")"</span>)) {
      <span style="color: #f92672; font-weight: bold;">return</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">"("</span>)) {
      k_one_string();
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      <span style="color: #FF8888;">// </span><span style="color: #FF8888;">do nothing</span>
    }
  }
}

<span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_one_string</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [compile])</span>
  <span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">buffer</span>[1024 * 1024];
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">cursor</span> = 0;
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">c</span> = read_char();
    <span style="color: #f92672; font-weight: bold;">if</span> (c == <span style="color: #e6db74;">')'</span>) {
      buffer[cursor] = 0;
      cursor++;
      <span style="color: #f92672; font-weight: bold;">break</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      buffer[cursor] = c;
      cursor++;
    }
  }
  <span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">str</span> = malloc(cursor);
  strcpy(str, buffer);
  here(str2jo(<span style="color: #e6db74;">"i-lit"</span>));
  here(str);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ae7990" class="outline-3">
<h3 id="org4ae7990">p_print_string</h3>
<div class="outline-text-3" id="text-org4ae7990">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_print_string</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(string -&gt; [io])</span>
  printf(<span style="color: #e6db74;">"%s"</span>, as_pop());
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1269784" class="outline-3">
<h3 id="org1269784">export_string</h3>
<div class="outline-text-3" id="text-org1269784">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_string</span>() {
  defprim(<span style="color: #e6db74;">"string"</span>, k_string);
  defprim(<span style="color: #e6db74;">"print-string"</span>, p_print_string);
}
</pre>
</div>
</div>
</div>
</div>
