jojo.org
*** p_read_file

    #+begin_src c
    void p_read_file() {
      // (string addr number -> number)
      cell limit = as_pop();
      cell buffer = as_pop();
      cell path = as_pop();
      FILE* fp = fopen(path, "r");
      if(!fp) {
        perror("p_read_file file to open file");
        return EXIT_FAILURE;
      }
      cell readed_counter = fread(buffer, 1, limit, fp);
      fclose(fp);
      as_push(readed_counter);
    }
    #+end_src

*** file_readable_p

    #+begin_src c
    bool file_readable_p(string path) {
      FILE* fp = fopen(path, "r");
      if (!fp) {
        return false;
      }
      else {
        fclose(fp);
        return true;
      }
    }
    #+end_src

*** export_file

    #+begin_src c
    void export_file() {
      defprim("read-file", p_read_file);
    }
    #+end_src

* *keyword*

*** k_ignore

    #+begin_src c
    void k_ignore() {
      // ([io] ->)
      while (true) {
        jo s = read_jo();
        if (s == str2jo("(")) {
          k_ignore();
        }
        if (s == str2jo(")")) {
          break;
        }
      }
    }
    #+end_src

*** k_if

***** note

      - (if a b p? -> c d)

      - a b p?
        [jump] jumk_if_false
        c d
        :jump

      - because the use of as_snapshot
        bar can not be nested in antecedent

***** compile_question

      #+begin_src c
      void compile_question() {
        // ([io] -> [compile])
        while (true) {
          jo s = read_jo();
          if (s == str2jo("(")) {
            eval_key(read_jo());
          }
          else if (s == str2jo("->")) {
            break;
          }
          else {
            here(s);
          }
        }
      }
      #+end_src

***** compile_answer

      #+begin_src c
      void compile_answer() {
        // ([io] -> [compile])
        here(str2jo("i-lit"));
        cell* offset_place = compiling_stack_tos();
        compiling_stack_inc();
        here(str2jo("jump-if-false"));
        while (true) {
          jo s = read_jo();
          if (s == str2jo("(")) {
            eval_key(read_jo());
          }
          else if (s == str2jo(")")) {
            break;
          }
          else {
            here(s);
          }
        }
        offset_place[0] = compiling_stack_tos();
      }
      #+end_src

***** k_if

      #+begin_src c
      void k_if() {
        // ([io] -> [compile])
        compile_question();
        compile_answer();
      }
      #+end_src

*** k_else

    #+begin_src c
    void k_else() {
      // ([io] -> [compile])
      here(str2jo("i-lit"));
      here(true);
      compile_answer();
    }
    #+end_src

*** k_tail_call

    #+begin_src c
    void k_tail_call() {
      // ([io] -> [compile])
      here(str2jo("i-tail-call"));
      jo s = read_jo();
      here(s);
      k_ignore();
    }
    #+end_src

*** export_keyword

    #+begin_src c
    void export_keyword() {
      defprim(":", k_ignore);
      defprim("note", k_ignore);
      defprim("if", k_if);
      defprim("else", k_else);
      defprim("tail-call", k_tail_call);
    }
    #+end_src

* *system*

*** p_getcwd

    #+begin_src c
    void p_getcwd() {
      // (-> string)
      char buf[1024];
      as_push(getcwd(buf, 1024));
    }
    #+end_src

*** export_system

    #+begin_src c
    void export_system() {
      defprim("getcwd", p_getcwd);
    }
    #+end_src

* *module*

*** user_module_path

    #+begin_src c
    string user_module_path = "/home/xyh/.jojo/module/";
    #+end_src

*** system_module_path

    #+begin_src c
    string system_module_path = "";
    #+end_src

