jojo.html

<div id="outline-container-org29359d7" class="outline-2">
<h2 id="org29359d7"><b>file</b></h2>
<div class="outline-text-2" id="text-org29359d7">
</div><div id="outline-container-orgd354da0" class="outline-3">
<h3 id="orgd354da0">p_read_file</h3>
<div class="outline-text-3" id="text-orgd354da0">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_read_file</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(string addr number -&gt; number)</span>
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">limit</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">buffer</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">path</span> = as_pop();
  <span style="color: #66d9ef; font-weight: bold;">FILE</span>* <span style="color: #fd971f;">fp</span> = fopen(path, <span style="color: #e6db74;">"r"</span>);
  <span style="color: #f92672; font-weight: bold;">if</span>(<span style="color: #960050;">!</span>fp) {
    perror(<span style="color: #e6db74;">"p_read_file file to open file"</span>);
    <span style="color: #f92672; font-weight: bold;">return</span> EXIT_FAILURE;
  }
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">readed_counter</span> = fread(buffer, 1, limit, fp);
  fclose(fp);
  as_push(readed_counter);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5547c55" class="outline-3">
<h3 id="org5547c55">file_readable_p</h3>
<div class="outline-text-3" id="text-org5547c55">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">file_readable_p</span>(<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">path</span>) {
  <span style="color: #66d9ef; font-weight: bold;">FILE</span>* <span style="color: #fd971f;">fp</span> = fopen(path, <span style="color: #e6db74;">"r"</span>);
  <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #960050;">!</span>fp) {
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">false</span>;
  }
  <span style="color: #f92672; font-weight: bold;">else</span> {
    fclose(fp);
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">true</span>;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org581cddd" class="outline-3">
<h3 id="org581cddd">export_file</h3>
<div class="outline-text-3" id="text-org581cddd">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_file</span>() {
  defprim(<span style="color: #e6db74;">"read-file"</span>, p_read_file);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org53f6750" class="outline-2">
<h2 id="org53f6750"><b>keyword</b></h2>
<div class="outline-text-2" id="text-org53f6750">
</div><div id="outline-container-orgd9da42a" class="outline-3">
<h3 id="orgd9da42a">k_ignore</h3>
<div class="outline-text-3" id="text-orgd9da42a">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_ignore</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt;)</span>
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">s</span> = read_jo();
    <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">"("</span>)) {
      k_ignore();
    }
    <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">")"</span>)) {
      <span style="color: #f92672; font-weight: bold;">break</span>;
    }
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgebe0fea" class="outline-3">
<h3 id="orgebe0fea">k_if</h3>
<div class="outline-text-3" id="text-orgebe0fea">
</div><div id="outline-container-org68ef8b1" class="outline-4">
<h4 id="org68ef8b1"><span class="todo note">note</span> </h4>
<div class="outline-text-4" id="text-org68ef8b1">
<ul class="org-ul">
<li><p>(if a b p? -&gt; c d)</p></li>

<li><p>a b p?</p><p>[jump] jumk_if_false</p><p>c d</p><p>:jump</p></li>

<li><p>because the use of as_snapshot</p><p>bar can not be nested in antecedent</p></li></ul>
</div>
</div>

<div id="outline-container-org9e3cc78" class="outline-4">
<h4 id="org9e3cc78">compile_question</h4>
<div class="outline-text-4" id="text-org9e3cc78">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">compile_question</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [compile])</span>
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">s</span> = read_jo();
    <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">"("</span>)) {
      eval_key(read_jo());
    }
    <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">"-&gt;"</span>)) {
      <span style="color: #f92672; font-weight: bold;">break</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      here(s);
    }
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf50645" class="outline-4">
<h4 id="orgbf50645">compile_answer</h4>
<div class="outline-text-4" id="text-orgbf50645">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">compile_answer</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [compile])</span>
  here(str2jo(<span style="color: #e6db74;">"i-lit"</span>));
  <span style="color: #66d9ef; font-weight: bold;">cell</span>* <span style="color: #fd971f;">offset_place</span> = compiling_stack_tos();
  compiling_stack_inc();
  here(str2jo(<span style="color: #e6db74;">"jump-if-false"</span>));
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">s</span> = read_jo();
    <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">"("</span>)) {
      eval_key(read_jo());
    }
    <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">")"</span>)) {
      <span style="color: #f92672; font-weight: bold;">break</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      here(s);
    }
  }
  offset_place[0] = compiling_stack_tos();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeea6814" class="outline-4">
<h4 id="orgeea6814">k_if</h4>
<div class="outline-text-4" id="text-orgeea6814">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_if</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [compile])</span>
  compile_question();
  compile_answer();
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7f116f4" class="outline-3">
<h3 id="org7f116f4">k_else</h3>
<div class="outline-text-3" id="text-org7f116f4">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_else</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [compile])</span>
  here(str2jo(<span style="color: #e6db74;">"i-lit"</span>));
  here(<span style="color: #ae81ff;">true</span>);
  compile_answer();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf1e7c0a" class="outline-3">
<h3 id="orgf1e7c0a">k_tail_call</h3>
<div class="outline-text-3" id="text-orgf1e7c0a">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_tail_call</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [compile])</span>
  here(str2jo(<span style="color: #e6db74;">"i-tail-call"</span>));
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">s</span> = read_jo();
  here(s);
  k_ignore();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e3b6d8" class="outline-3">
<h3 id="org2e3b6d8">export_keyword</h3>
<div class="outline-text-3" id="text-org2e3b6d8">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_keyword</span>() {
  defprim(<span style="color: #e6db74;">":"</span>, k_ignore);
  defprim(<span style="color: #e6db74;">"note"</span>, k_ignore);
  defprim(<span style="color: #e6db74;">"if"</span>, k_if);
  defprim(<span style="color: #e6db74;">"else"</span>, k_else);
  defprim(<span style="color: #e6db74;">"tail-call"</span>, k_tail_call);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc273d3b" class="outline-2">
<h2 id="orgc273d3b"><b>system</b></h2>
<div class="outline-text-2" id="text-orgc273d3b">
</div><div id="outline-container-orgb759bae" class="outline-3">
<h3 id="orgb759bae">p_getcwd</h3>
<div class="outline-text-3" id="text-orgb759bae">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_getcwd</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(-&gt; string)</span>
  <span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">buf</span>[1024];
  as_push(getcwd(buf, 1024));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8b6922" class="outline-3">
<h3 id="orge8b6922">export_system</h3>
<div class="outline-text-3" id="text-orge8b6922">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_system</span>() {
  defprim(<span style="color: #e6db74;">"getcwd"</span>, p_getcwd);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org231db7d" class="outline-2">
<h2 id="org231db7d"><b>module</b></h2>
<div class="outline-text-2" id="text-org231db7d">
</div><div id="outline-container-orgdeda555" class="outline-3">
<h3 id="orgdeda555">user_module_path</h3>
<div class="outline-text-3" id="text-orgdeda555">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">user_module_path</span> = <span style="color: #e6db74;">"/home/xyh/.jojo/module/"</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcea3a12" class="outline-3">
<h3 id="orgcea3a12">system_module_path</h3>
<div class="outline-text-3" id="text-orgcea3a12">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">system_module_path</span> = <span style="color: #e6db74;">""</span>;
</pre>
</div>
</div>
</div>
