jojo.org
*** module_stack

    - just record what modules are loaded
      and their meta-data :
      - path

    #+begin_src c
    typedef struct {
      jo name;
      string path;
    } module;

    typedef module module_stack_t[1024];

    module_stack_t module_stack;
    cell module_stack_base = 0;
    cell module_stack_pointer = 0;

    void module_stack_push(module value) {
      module_stack[module_stack_pointer] = value;
      module_stack_pointer++;
    }

    module module_stack_tos() {
      return module_stack[module_stack_pointer - 1];
    }


    bool module_stack_empty_p() {
      return module_stack_pointer == module_stack_base;
    }

    bool module_stack_find(jo name) {
      cell i = 0;
      while (i < module_stack_pointer) {
        if (name == module_stack[i].name) {
          return true;
        }
        else {
          // do nothing
        }
      }
      return false;
    }
    #+end_src

*** load_file

    #+begin_src c
    void load_file(string path) {
      FILE* fp = fopen(path, "r");
      if(!fp) {
        perror("File opening failed");
        printf("load_file fail : %s\n", path);
        return EXIT_FAILURE;
      }
      reading_stack_push(fp);
      alias record[alias_record_size];
      alias a = {.nick = 0, .name = 0};
      record[0] = a;
      loading_stack_push(record);
    }
    #+end_src

*** find_module

    #+begin_src c
    string find_module(jo name) {
      // return 0 -- not found
      char path[1024];
      getcwd(path, 1024);
      strcat(path, "/");
      strcat(path, jo2str(name));
      strcat(path, ".jo");
      if (file_readable_p(path)) {
        return copy_to_string_area(path);
      }
      else {
        return 0;
      }
    }
    #+end_src

*** load_module

    #+begin_src c
    bool load_module(jo name) {
      string path = find_module(name);
      if (path == 0) {
        return false;
      }
      load_file(path);
      module m = {
        .name = name,
        .path = path
      };
      module_stack_push(m);
      return true;
    }
    #+end_src

*** k_import

***** k_add_alias

      #+begin_src c
      void k_add_alias(jo prefix) {
        // ([io] -> [loading_stack])
        while (true) {
          jo s = read_jo();
          if (s == str2jo(")")) {
            return;
          }
          else if (s == str2jo("(")) {
            eval_key(read_jo());
          }
          if (!alias_find(s) == 0) {
            printf("k_add_alias fail, alias used : %s\n", jo2str(s));
            k_ignore();
            return;
          }
          else {
            char str[1024];
            str[0] = 0;
            strcat(str, jo2str(prefix));
            strcat(str, "/");
            strcat(str, jo2str(s));
            alias_add(s, str2jo(str));
          }
        }
      }
      #+end_src

***** k_one_module

      #+begin_src c
      void k_one_module() {
        // ([io] -> [loading_stack])
        jo name = read_jo();
        if (!module_stack_find(name)) {
          if(!load_module(name)) {
            printf("k_one_module fail to load module : %s\n", jo2str(name));
            k_ignore();
          }
        }
        k_add_alias(name);
      }
      #+end_src

***** k_import

      #+begin_src c
      void k_import() {
        // ([io] -> [loading_stack])
        while (true) {
          jo s = read_jo();
          if (s == str2jo(")")) {
            return;
          }
          else if (s == str2jo("(")) {
            k_one_module();
          }
          else {
            // do nothing
          }
        }
      }
      #+end_src

*** export_module

    #+begin_src c
    void export_module() {
      defprim("import", k_import);
    }
    #+end_src

* *ffi*

