jojo.html

<div id="outline-container-org8aa7f22" class="outline-3">
<h3 id="org8aa7f22">module_stack</h3>
<div class="outline-text-3" id="text-org8aa7f22">
<ul class="org-ul">
<li><p>just record what modules are loaded</p><p>and their meta-data :</p><p><ul class="org-ul"></p><p><li><p>path</p></li></ul></p></li></ul>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #f92672; font-weight: bold;">struct</span> {
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">name</span>;
  <span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">path</span>;
} <span style="color: #66d9ef; font-weight: bold;">module</span>;

<span style="color: #f92672; font-weight: bold;">typedef</span> <span style="color: #66d9ef; font-weight: bold;">module</span> <span style="color: #66d9ef; font-weight: bold;">module_stack_t</span>[1024];

<span style="color: #66d9ef; font-weight: bold;">module_stack_t</span> <span style="color: #fd971f;">module_stack</span>;
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">module_stack_base</span> = 0;
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">module_stack_pointer</span> = 0;

<span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">module_stack_push</span>(<span style="color: #66d9ef; font-weight: bold;">module</span> <span style="color: #fd971f;">value</span>) {
  module_stack[module_stack_pointer] = value;
  module_stack_pointer++;
}

<span style="color: #66d9ef; font-weight: bold;">module</span> <span style="color: #a6e22e;">module_stack_tos</span>() {
  <span style="color: #f92672; font-weight: bold;">return</span> module_stack[module_stack_pointer - 1];
}


<span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">module_stack_empty_p</span>() {
  <span style="color: #f92672; font-weight: bold;">return</span> module_stack_pointer == module_stack_base;
}

<span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">module_stack_find</span>(<span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">name</span>) {
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">i</span> = 0;
  <span style="color: #f92672; font-weight: bold;">while</span> (i &lt; module_stack_pointer) {
    <span style="color: #f92672; font-weight: bold;">if</span> (name == module_stack[i].name) {
      <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">true</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      <span style="color: #FF8888;">// </span><span style="color: #FF8888;">do nothing</span>
    }
  }
  <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">false</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3533036" class="outline-3">
<h3 id="org3533036">load_file</h3>
<div class="outline-text-3" id="text-org3533036">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">load_file</span>(<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">path</span>) {
  <span style="color: #66d9ef; font-weight: bold;">FILE</span>* <span style="color: #fd971f;">fp</span> = fopen(path, <span style="color: #e6db74;">"r"</span>);
  <span style="color: #f92672; font-weight: bold;">if</span>(<span style="color: #960050;">!</span>fp) {
    perror(<span style="color: #e6db74;">"File opening failed"</span>);
    printf(<span style="color: #e6db74;">"load_file fail : %s\n"</span>, path);
    <span style="color: #f92672; font-weight: bold;">return</span> EXIT_FAILURE;
  }
  reading_stack_push(fp);
  <span style="color: #66d9ef; font-weight: bold;">alias</span> <span style="color: #fd971f;">record</span>[alias_record_size];
  <span style="color: #66d9ef; font-weight: bold;">alias</span> <span style="color: #fd971f;">a</span> = {.nick = 0, .name = 0};
  record[0] = a;
  loading_stack_push(record);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb7af29" class="outline-3">
<h3 id="orgbb7af29">find_module</h3>
<div class="outline-text-3" id="text-orgbb7af29">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #a6e22e;">find_module</span>(<span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">name</span>) {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">return 0 -- not found</span>
  <span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">path</span>[1024];
  getcwd(path, 1024);
  strcat(path, <span style="color: #e6db74;">"/"</span>);
  strcat(path, jo2str(name));
  strcat(path, <span style="color: #e6db74;">".jo"</span>);
  <span style="color: #f92672; font-weight: bold;">if</span> (file_readable_p(path)) {
    <span style="color: #f92672; font-weight: bold;">return</span> copy_to_string_area(path);
  }
  <span style="color: #f92672; font-weight: bold;">else</span> {
    <span style="color: #f92672; font-weight: bold;">return</span> 0;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd784753" class="outline-3">
<h3 id="orgd784753">load_module</h3>
<div class="outline-text-3" id="text-orgd784753">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #a6e22e;">load_module</span>(<span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">name</span>) {
  <span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">path</span> = find_module(name);
  <span style="color: #f92672; font-weight: bold;">if</span> (path == 0) {
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">false</span>;
  }
  load_file(path);
  <span style="color: #66d9ef; font-weight: bold;">module</span> <span style="color: #fd971f;">m</span> = {
    .name = name,
    .path = path
  };
  module_stack_push(m);
  <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">true</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org93839e3" class="outline-3">
<h3 id="org93839e3">k_import</h3>
<div class="outline-text-3" id="text-org93839e3">
</div><div id="outline-container-org7e6d030" class="outline-4">
<h4 id="org7e6d030">k_add_alias</h4>
<div class="outline-text-4" id="text-org7e6d030">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_add_alias</span>(<span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">prefix</span>) {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [loading_stack])</span>
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">s</span> = read_jo();
    <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">")"</span>)) {
      <span style="color: #f92672; font-weight: bold;">return</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">"("</span>)) {
      eval_key(read_jo());
    }
    <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #960050;">!</span>alias_find(s) == 0) {
      printf(<span style="color: #e6db74;">"k_add_alias fail, alias used : %s\n"</span>, jo2str(s));
      k_ignore();
      <span style="color: #f92672; font-weight: bold;">return</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      <span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">str</span>[1024];
      str[0] = 0;
      strcat(str, jo2str(prefix));
      strcat(str, <span style="color: #e6db74;">"/"</span>);
      strcat(str, jo2str(s));
      alias_add(s, str2jo(str));
    }
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcfd5d60" class="outline-4">
<h4 id="orgcfd5d60">k_one_module</h4>
<div class="outline-text-4" id="text-orgcfd5d60">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_one_module</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [loading_stack])</span>
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">name</span> = read_jo();
  <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #960050;">!</span>module_stack_find(name)) {
    <span style="color: #f92672; font-weight: bold;">if</span>(<span style="color: #960050;">!</span>load_module(name)) {
      printf(<span style="color: #e6db74;">"k_one_module fail to load module : %s\n"</span>, jo2str(name));
      k_ignore();
    }
  }
  k_add_alias(name);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7bdc074" class="outline-4">
<h4 id="org7bdc074">k_import</h4>
<div class="outline-text-4" id="text-org7bdc074">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_import</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [loading_stack])</span>
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">s</span> = read_jo();
    <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">")"</span>)) {
      <span style="color: #f92672; font-weight: bold;">return</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">"("</span>)) {
      k_one_module();
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      <span style="color: #FF8888;">// </span><span style="color: #FF8888;">do nothing</span>
    }
  }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1d8610a" class="outline-3">
<h3 id="org1d8610a">export_module</h3>
<div class="outline-text-3" id="text-org1d8610a">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_module</span>() {
  defprim(<span style="color: #e6db74;">"import"</span>, k_import);
}
</pre>
</div>
</div>
</div>
</div>
