jojo.org
*** get_clib

    #+begin_src c
    void* get_clib(string path) {
      void* lib = dlopen(path, RTLD_LAZY);
      if (lib == NULL) {
        printf("fail to open library : %s : %s\n",
               path, dlerror());
      };
      return lib;
    }
    #+end_src

*** ccall

    #+begin_src c
    void ccall (string str, void* lib) {
      primitive fun = dlsym(lib, str);
      if (fun == NULL) {
        printf("can not find %s function lib : %s\n",
               str, dlerror());
      };
      fun();
    }
    #+end_src

*** k_clib

    #+begin_src c
    void k_clib() {
      // ([io] -> [compile])
      while (true) {
        jo s = read_jo();
        if (s == str2jo(")")) {
          return;
        }
        else if (s == str2jo("(")) {
          k_one_clib();
        }
        else {
          // do nothing
        }
      }
    }

    void k_one_clib() {
      // ([io] -> [compile])
      char buffer[1024];
      cell cursor = 0;
      while (true) {
        char c = read_char();
        if (c == ')') {
          buffer[cursor] = 0;
          cursor++;
          break;
        }
        else {
          buffer[cursor] = c;
          cursor++;
        }
      }
      ccall("export", get_clib(buffer));
    }
    #+end_src

*** export_ffi

    #+begin_src c
    void export_ffi() {
      defprim("clib", k_clib);
    }
    #+end_src

* *top_level*

*** read_alias_jo

    #+begin_src c
    jo read_alias_jo() {
      jo alias_jo = read_jo();
      if (module_stack_empty_p()) {
        return alias_jo;
      }
      else {
        jo new_jo = cat_jo(cat_jo(module_stack_tos().name,
                                         str2jo("/")),
                                  alias_jo);
        alias_add(alias_jo, new_jo);
        return new_jo;
      }
    }
    #+end_src

*** defun_record

    #+begin_src c
    jo defun_record[64 * 1024];
    cell defun_record_counter = 0;
    #+end_src

*** k_defun

    #+begin_src c
    void k_defun() {
      // ([io] -> [compile] [jotable])
      jo index = read_alias_jo();
      defun_record[defun_record_counter] = index;
      defun_record_counter++;
      defun_record[defun_record_counter] = 0;
      jo* array = compiling_stack_tos();
      while (true) {
        jo s = read_jo();
        if (s == str2jo("(")) {
          eval_key(read_jo());
        }
        else if (s == str2jo(")")) {
          here(str2jo("end"));
          break;
        }
        else {
          here(s);
        }
      }
      jotable[index].type = str2jo("jojo");
      jotable[index].value.jojo.size = compiling_stack_tos() - array;
      jotable[index].value.jojo.array = array;
    }
    #+end_src

*** >< k_declare

    #+begin_src c
    void k_declare() {

    }
    #+end_src

*** k_run

    #+begin_src c
    void k_run() {
      // ([io] -> *)
      jo array[64 * 1024];
      compiling_stack_push(array);
      while (true) {
        jo s = read_jo();
        if (s == str2jo("(")) {
          eval_key(read_jo());
        }
        else if (s == str2jo(")")) {
          here(str2jo("end"));
          break;
        }
        else {
          here(s);
        }
      }
      compiling_stack_pop();
      eval_jojo(array);
    }
    #+end_src

*** defvar_record

    #+begin_src c
    jo defvar_record[64 * 1024];
    cell defvar_record_counter = 0;
    #+end_src

*** p_defvar_record

    #+begin_src c
    void p_defvar_record() {
      // (-> addr)
      as_push(defvar_record);
    }
    #+end_src

*** k_defvar

    #+begin_src c
    void k_defvar() {
      // ([io] -> [compile] [jotable])
      jo index = read_alias_jo();
      defvar_record[defvar_record_counter] = index;
      defvar_record_counter++;
      defvar_record[defvar_record_counter] = 0;
      k_run();
      jotable_set_cell(index, as_pop());
    }
    #+end_src

*** p_top_repl

    #+begin_src c
    void p_top_repl() {
      // ([io] -> *)
      while (true) {
        jo s = read_jo();
        if (s == str2jo("(")) {
          eval_key(read_jo());
        }
        else {
          // do nothing
        }
      }
    }
    #+end_src

