jojo.html

<div id="outline-container-orgfde8c" class="outline-2">
<h2 id="orgfde8c"><b>ffi</b></h2>
<div class="outline-text-2" id="text-orgfde8c">
</div><div id="outline-container-orgbe0cb46" class="outline-3">
<h3 id="orgbe0cb46">get_clib</h3>
<div class="outline-text-3" id="text-orgbe0cb46">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span>* <span style="color: #a6e22e;">get_clib</span>(<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">path</span>) {
  <span style="color: #66d9ef; font-weight: bold;">void</span>* <span style="color: #fd971f;">lib</span> = dlopen(path, RTLD_LAZY);
  <span style="color: #f92672; font-weight: bold;">if</span> (lib == <span style="color: #ae81ff;">NULL</span>) {
    printf(<span style="color: #e6db74;">"fail to open library : %s : %s\n"</span>,
           path, dlerror());
  };
  <span style="color: #f92672; font-weight: bold;">return</span> lib;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfafd2e4" class="outline-3">
<h3 id="orgfafd2e4">ccall</h3>
<div class="outline-text-3" id="text-orgfafd2e4">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">ccall</span> (<span style="color: #66d9ef; font-weight: bold;">string</span> <span style="color: #fd971f;">str</span>, <span style="color: #66d9ef; font-weight: bold;">void</span>* <span style="color: #fd971f;">lib</span>) {
  <span style="color: #66d9ef; font-weight: bold;">primitive</span> <span style="color: #fd971f;">fun</span> = dlsym(lib, str);
  <span style="color: #f92672; font-weight: bold;">if</span> (fun == <span style="color: #ae81ff;">NULL</span>) {
    printf(<span style="color: #e6db74;">"can not find %s function lib : %s\n"</span>,
           str, dlerror());
  };
  fun();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org74f2c36" class="outline-3">
<h3 id="org74f2c36">k_clib</h3>
<div class="outline-text-3" id="text-org74f2c36">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_clib</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [compile])</span>
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">s</span> = read_jo();
    <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">")"</span>)) {
      <span style="color: #f92672; font-weight: bold;">return</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">"("</span>)) {
      k_one_clib();
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      <span style="color: #FF8888;">// </span><span style="color: #FF8888;">do nothing</span>
    }
  }
}

<span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_one_clib</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [compile])</span>
  <span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">buffer</span>[1024];
  <span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">cursor</span> = 0;
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">c</span> = read_char();
    <span style="color: #f92672; font-weight: bold;">if</span> (c == <span style="color: #e6db74;">')'</span>) {
      buffer[cursor] = 0;
      cursor++;
      <span style="color: #f92672; font-weight: bold;">break</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      buffer[cursor] = c;
      cursor++;
    }
  }
  ccall(<span style="color: #e6db74;">"export"</span>, get_clib(buffer));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga79e152" class="outline-3">
<h3 id="orga79e152">export_ffi</h3>
<div class="outline-text-3" id="text-orga79e152">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_ffi</span>() {
  defprim(<span style="color: #e6db74;">"clib"</span>, k_clib);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org277ab63" class="outline-2">
<h2 id="org277ab63"><b>top_level</b></h2>
<div class="outline-text-2" id="text-org277ab63">
</div><div id="outline-container-orga0784d7" class="outline-3">
<h3 id="orga0784d7">read_alias_jo</h3>
<div class="outline-text-3" id="text-orga0784d7">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #a6e22e;">read_alias_jo</span>() {
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">alias_jo</span> = read_jo();
  <span style="color: #f92672; font-weight: bold;">if</span> (module_stack_empty_p()) {
    <span style="color: #f92672; font-weight: bold;">return</span> alias_jo;
  }
  <span style="color: #f92672; font-weight: bold;">else</span> {
    <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">new_jo</span> = cat_jo(cat_jo(module_stack_tos().name,
                                     str2jo(<span style="color: #e6db74;">"/"</span>)),
                              alias_jo);
    alias_add(alias_jo, new_jo);
    <span style="color: #f92672; font-weight: bold;">return</span> new_jo;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org76c3afa" class="outline-3">
<h3 id="org76c3afa">defun_record</h3>
<div class="outline-text-3" id="text-org76c3afa">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">defun_record</span>[64 * 1024];
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">defun_record_counter</span> = 0;
</pre>
</div>
</div>
</div>

<div id="outline-container-org23e26fb" class="outline-3">
<h3 id="org23e26fb">k_defun</h3>
<div class="outline-text-3" id="text-org23e26fb">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_defun</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [compile] [jotable])</span>
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">index</span> = read_alias_jo();
  defun_record[defun_record_counter] = index;
  defun_record_counter++;
  defun_record[defun_record_counter] = 0;
  <span style="color: #66d9ef; font-weight: bold;">jo</span>* <span style="color: #fd971f;">array</span> = compiling_stack_tos();
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">s</span> = read_jo();
    <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">"("</span>)) {
      eval_key(read_jo());
    }
    <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">")"</span>)) {
      here(str2jo(<span style="color: #e6db74;">"end"</span>));
      <span style="color: #f92672; font-weight: bold;">break</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      here(s);
    }
  }
  jotable[index].type = str2jo(<span style="color: #e6db74;">"jojo"</span>);
  jotable[index].value.jojo.size = compiling_stack_tos() - array;
  jotable[index].value.jojo.array = array;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfe41c82" class="outline-3">
<h3 id="orgfe41c82"><span class="todo _gt__lt_">&gt;&lt;</span> k_declare</h3>
<div class="outline-text-3" id="text-orgfe41c82">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_declare</span>() {

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f28cb0" class="outline-3">
<h3 id="org7f28cb0">k_run</h3>
<div class="outline-text-3" id="text-org7f28cb0">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_run</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; *)</span>
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">array</span>[64 * 1024];
  compiling_stack_push(array);
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">s</span> = read_jo();
    <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">"("</span>)) {
      eval_key(read_jo());
    }
    <span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">")"</span>)) {
      here(str2jo(<span style="color: #e6db74;">"end"</span>));
      <span style="color: #f92672; font-weight: bold;">break</span>;
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      here(s);
    }
  }
  compiling_stack_pop();
  eval_jojo(array);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc4aa5d5" class="outline-3">
<h3 id="orgc4aa5d5">defvar_record</h3>
<div class="outline-text-3" id="text-orgc4aa5d5">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">defvar_record</span>[64 * 1024];
<span style="color: #66d9ef; font-weight: bold;">cell</span> <span style="color: #fd971f;">defvar_record_counter</span> = 0;
</pre>
</div>
</div>
</div>

<div id="outline-container-org39d1d67" class="outline-3">
<h3 id="org39d1d67">p_defvar_record</h3>
<div class="outline-text-3" id="text-org39d1d67">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_defvar_record</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(-&gt; addr)</span>
  as_push(defvar_record);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5eb95aa" class="outline-3">
<h3 id="org5eb95aa">k_defvar</h3>
<div class="outline-text-3" id="text-org5eb95aa">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">k_defvar</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; [compile] [jotable])</span>
  <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">index</span> = read_alias_jo();
  defvar_record[defvar_record_counter] = index;
  defvar_record_counter++;
  defvar_record[defvar_record_counter] = 0;
  k_run();
  jotable_set_cell(index, as_pop());
}
</pre>
</div>
</div>
</div>
