jojo.org
*** export_top_level

    #+begin_src c
    void export_top_level() {
      defprim("defun", k_defun);
      defprim("declare", k_declare);
      defprim("run", k_run);
      defprim("defvar", k_defvar);
      defprim("defvar-record", p_defvar_record);
      defprim("top-repl", p_top_repl);
    }
    #+end_src

* *misc*

*** do_nothing

    #+begin_src c
    void do_nothing() {
    }
    #+end_src

*** p_round_bar

    #+begin_src c
    void p_round_bar() {
      // (-> cell)
      as_push(str2jo("("));
    }
    #+end_src

*** p_cell_size

    #+begin_src c
    void p_cell_size() {
      // (-> cell)
      as_push(sizeof(cell));
    }
    #+end_src

*** p_newline

    #+begin_src c
    void p_newline() {
      printf("\n");
    }
    #+end_src

*** export_mise

    #+begin_src c
    void export_mise() {
      defprim("apply", p_apply);
      defprim("jotable-report", jotable_report);
      defprim("round-bar", p_round_bar);
      defprim("cell-size", p_cell_size);
      defprim("defprim-report", defprim_report);
      defprim("newline", p_newline);
    }
    #+end_src

* *play*

*** p1

    #+begin_src c
    void p1() {
      printf("k1: %ld %ld\n", sizeof(void*), sizeof(intptr_t));
    }
    #+end_src

*** p2

    #+begin_src c
    void p2() {

    }
    #+end_src

*** p3

    #+begin_src c
    void p3() {

    }
    #+end_src

*** export_play

    #+begin_src c
    void export_play() {
      defprim("p1", p1);
      defprim("p2", p2);
      defprim("p3", p3);
    }
    #+end_src

* epilog

*** run_basic_repl

    #+begin_src c
    void run_basic_repl() {
      init_jotable();
      init_compiling_stack();
      init_loading_stack();

      export_stack_operation();
      export_ending();
      export_control();
      export_integer();
      export_memory();
      export_jo();
      export_string();
      export_file();
      export_bool();
      export_keyword();
      export_system();
      export_module();
      export_ffi();
      export_top_level();
      export_mise();
      export_play();

      p_top_repl();
    }
    #+end_src

*** main

    #+begin_src c
    int main(int argc, string* argv) {
      if (argc == 1) {
        run_basic_repl();
      }
      else {
        load_file(argv[1]);
        run_basic_repl();
      }
    }
    #+end_src
