jojo.html

<div id="outline-container-org761f7f3" class="outline-3">
<h3 id="org761f7f3">p_top_repl</h3>
<div class="outline-text-3" id="text-org761f7f3">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_top_repl</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">([io] -&gt; *)</span>
  <span style="color: #f92672; font-weight: bold;">while</span> (<span style="color: #ae81ff;">true</span>) {
    <span style="color: #66d9ef; font-weight: bold;">jo</span> <span style="color: #fd971f;">s</span> = read_jo();
    <span style="color: #f92672; font-weight: bold;">if</span> (s == str2jo(<span style="color: #e6db74;">"("</span>)) {
      eval_key(read_jo());
    }
    <span style="color: #f92672; font-weight: bold;">else</span> {
      <span style="color: #FF8888;">// </span><span style="color: #FF8888;">do nothing</span>
    }
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5530aeb" class="outline-3">
<h3 id="org5530aeb">export_top_level</h3>
<div class="outline-text-3" id="text-org5530aeb">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_top_level</span>() {
  defprim(<span style="color: #e6db74;">"defun"</span>, k_defun);
  defprim(<span style="color: #e6db74;">"declare"</span>, k_declare);
  defprim(<span style="color: #e6db74;">"run"</span>, k_run);
  defprim(<span style="color: #e6db74;">"defvar"</span>, k_defvar);
  defprim(<span style="color: #e6db74;">"defvar-record"</span>, p_defvar_record);
  defprim(<span style="color: #e6db74;">"top-repl"</span>, p_top_repl);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2c8dd6b" class="outline-2">
<h2 id="org2c8dd6b"><b>misc</b></h2>
<div class="outline-text-2" id="text-org2c8dd6b">
</div><div id="outline-container-orgc0a30c0" class="outline-3">
<h3 id="orgc0a30c0">do_nothing</h3>
<div class="outline-text-3" id="text-orgc0a30c0">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">do_nothing</span>() {
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org668a01a" class="outline-3">
<h3 id="org668a01a">p_round_bar</h3>
<div class="outline-text-3" id="text-org668a01a">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_round_bar</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(-&gt; cell)</span>
  as_push(str2jo(<span style="color: #e6db74;">"("</span>));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org541d00c" class="outline-3">
<h3 id="org541d00c">p_cell_size</h3>
<div class="outline-text-3" id="text-org541d00c">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_cell_size</span>() {
  <span style="color: #FF8888;">// </span><span style="color: #FF8888;">(-&gt; cell)</span>
  as_push(<span style="color: #f92672; font-weight: bold;">sizeof</span>(cell));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org935114b" class="outline-3">
<h3 id="org935114b">p_newline</h3>
<div class="outline-text-3" id="text-org935114b">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p_newline</span>() {
  printf(<span style="color: #e6db74;">"\n"</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9dc0a44" class="outline-3">
<h3 id="org9dc0a44">export_mise</h3>
<div class="outline-text-3" id="text-org9dc0a44">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_mise</span>() {
  defprim(<span style="color: #e6db74;">"apply"</span>, p_apply);
  defprim(<span style="color: #e6db74;">"jotable-report"</span>, jotable_report);
  defprim(<span style="color: #e6db74;">"round-bar"</span>, p_round_bar);
  defprim(<span style="color: #e6db74;">"cell-size"</span>, p_cell_size);
  defprim(<span style="color: #e6db74;">"defprim-report"</span>, defprim_report);
  defprim(<span style="color: #e6db74;">"newline"</span>, p_newline);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga12ab1e" class="outline-2">
<h2 id="orga12ab1e"><b>play</b></h2>
<div class="outline-text-2" id="text-orga12ab1e">
</div><div id="outline-container-org103d086" class="outline-3">
<h3 id="org103d086">p1</h3>
<div class="outline-text-3" id="text-org103d086">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p1</span>() {
  printf(<span style="color: #e6db74;">"k1: %ld %ld\n"</span>, <span style="color: #f92672; font-weight: bold;">sizeof</span>(<span style="color: #66d9ef; font-weight: bold;">void</span>*), <span style="color: #f92672; font-weight: bold;">sizeof</span>(intptr_t));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8af4c1" class="outline-3">
<h3 id="orgf8af4c1">p2</h3>
<div class="outline-text-3" id="text-orgf8af4c1">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p2</span>() {

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd95f1cf" class="outline-3">
<h3 id="orgd95f1cf">p3</h3>
<div class="outline-text-3" id="text-orgd95f1cf">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">p3</span>() {

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cd2408" class="outline-3">
<h3 id="org8cd2408">export_play</h3>
<div class="outline-text-3" id="text-org8cd2408">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">export_play</span>() {
  defprim(<span style="color: #e6db74;">"p1"</span>, p1);
  defprim(<span style="color: #e6db74;">"p2"</span>, p2);
  defprim(<span style="color: #e6db74;">"p3"</span>, p3);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org18037b0" class="outline-2">
<h2 id="org18037b0">epilog</h2>
<div class="outline-text-2" id="text-org18037b0">
</div><div id="outline-container-org6dbaf84" class="outline-3">
<h3 id="org6dbaf84">run_basic_repl</h3>
<div class="outline-text-3" id="text-org6dbaf84">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">run_basic_repl</span>() {
  init_jotable();
  init_compiling_stack();
  init_loading_stack();

  export_stack_operation();
  export_ending();
  export_control();
  export_integer();
  export_memory();
  export_jo();
  export_string();
  export_file();
  export_bool();
  export_keyword();
  export_system();
  export_module();
  export_ffi();
  export_top_level();
  export_mise();
  export_play();

  p_top_repl();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ac1235" class="outline-3">
<h3 id="org6ac1235">main</h3>
<div class="outline-text-3" id="text-org6ac1235">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66d9ef; font-weight: bold;">int</span> <span style="color: #a6e22e;">main</span>(<span style="color: #66d9ef; font-weight: bold;">int</span> <span style="color: #fd971f;">argc</span>, <span style="color: #66d9ef; font-weight: bold;">string</span>* <span style="color: #fd971f;">argv</span>) {
  <span style="color: #f92672; font-weight: bold;">if</span> (argc == 1) {
    run_basic_repl();
  }
  <span style="color: #f92672; font-weight: bold;">else</span> {
    load_file(argv[1]);
    run_basic_repl();
  }
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
涕执我乎垂丧兮 懼余生之茫苦
</div>
</body>
</html>
